docs/orzo/multi-part-overtone-tutorial/personalized-overtone-wiki-in-one-file.org
* outline of the overtone wiki page--no code
**  Welcome to the Overtone Wiki

Our goal is to create a top notch live-coding environment and audio
collaboration platform that's free for everyone to download, hack on
and make crazy-cool sounds either individually or in groups. We've
come a long way towards achieving this vision and hope you'll join in
and help take things even further...

*** Technical Summary
Overtone is a musical programming library written in
[Clojure](http://clojure.org) which uses the
[SuperCollider](http://supercollider.sourceforge.net/) audio engine
and synthesis server under the covers. We're essentially marrying an
awesome live-synthesis server with an insanely cool state-of-the-art
lisp to create a glorious union that only the Gods can dream about.
Seriously though, we're building on existing and proven open source
technologies to create something we're truly excited about.

*** About this Documentation
We will try to maintain documentation for all aspects of the system
here, but beyond the basics feel free to pick and choose the topics
that interest you. Some people might want to focus on synthesizing new
sounds from scratch, while for others it might be more interesting to
focus on live-coding or generating musical scores on the fly.

If you see any errors/issues/omissions, please feel free to fix/add
things - we'll love you forever.

*** Contents
**** Installation
-  [[Installing Overtone]
-  [[Starting a REPL]
-  [[Connecting scsynth]
-  [[Installing and Starting Jack] (for Linux users)
-  [[Overtone on the Edge!]
-  [[Overtone in emacs]
-  [[Overtone in vim]

**** First steps
***** [Overtone Cheat Sheet](https://github.com/overtone/overtone/raw/master/docs/cheatsheet/overtone-cheat-sheet.pdf)
***** [[Getting Started]
****** assessment
Important for its intial presentation of dealing with sc "synths"

See this part of the current document for more:
[[id:51BA5E52-D1FB-4C62-AA7C-E83825E001C0][start with some basics of getting-started github wiki]]
***** [[Running Examples]
****** Orzo assessment
[[file:~/Github-repos/overtone-source/src/overtone/sc/examples/][file:~/Github-repos/overtone-source/src/overtone/sc/examples/]]

useful for simple demonstration of 

#+BEGIN_SRC clojure
(demo 10 (example dbrown :rand-walk))
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: user/audition-synth 160>
****** output of (examples)
******* raw output
#+BEGIN_SRC clojure :results output
(examples)
#+END_SRC

#+RESULTS:
#+begin_example
svf
  :state-filter    (:ar) - Create a state variable 
                           filter 

sound-in
  :mono-patch      (:ar) - World's most expensive 
                           patchcord 
  :stereo-patch    (:ar) - World's most expensive 
                           stereo patchcord 

impulse
  :poll            (:kr) - Poll an impulse to view 
                           its output 

send-reply
  :count           (:kr) - Send back an OSC 
                           message containing a 
                           rolling count 

amplitude
  :saw-vol         (:ar) - Use input amplitude to 
                           control saw amplitude 
  :sin-freq        (:ar) - Use input amplitude to 
                           control saw frequency 

dibrown
  :rand-walk       (:ar) - Random whole number 
                           walk through freqs with 
                           rate determined by 
                           mouse-x 

membrane-hexagon
  :mouse           (:kr) - Use mouse button, X and 
                           Y locations to play a 
                           drum. 

vosim
  :mouse1          (:ar) - Use mouse X location to 
                           control the frequency 
                           of the vosim. 
  :mouse2          (:ar) - Use the mouse X & Y 
                           location to modify some 
                           random vosim noises. 

membrane-circle
  :mouse           (:kr) - Use mouse button, X and 
                           Y locations to play a 
                           drum. 

dbrown
  :rand-walk       (:ar) - Random floating point 
                           number walk through 
                           freqs with rate 
                           determined by mouse-x 

dyn-klang
  :sin-osc         (:ar) - Use a sin-osc to change 
                           3 running sine 
                           oscillators 

dwhite
  :rand-seq        (:ar) - Play a random sequence 
                           of floats mapped to 
                           freqs with rate 
                           determined by mouse-x 

dyn-klank
  :mouse           (:ar) - Use mouse to change 3 
                           running frequency 
                           resonators 

compander
  :noise-gate      (:ar) - Use compander to create 
                           a noise gate 
  :data            (:ar) - View data coming out of 
                           a compander 

diwhite
  :rand-seq        (:ar) - Play a random sequence 
                           of integers mapped to 
                           freqs with rate 
                           determined by mouse-x 

b-moog
  :compare-filters (:ar) - Compare low, high, and 
                           bandpass 

iir-filter
  :low-pass        (:ar) - Create a low pass 
                           filter 

#+end_example
******* org-mode output
******** svf
  :state-filter    (:ar) - Create a state variable 
                           filter 
******** sound-in
[[file:~/Github-repos/overtone-source/src/overtone/sc/examples/audio_in.clj::(defexamples%20sound-in]]
  :mono-patch      (:ar) - World's most expensive 
                           patchcord 
  :stereo-patch    (:ar) - World's most expensive 
                           stereo patchcord 
******** impulse
  :poll            (:kr) - Poll an impulse to view 
                           its output 
******** send-reply
  :count           (:kr) - Send back an OSC 
                           message containing a 
                           rolling count 
******** amplitude
  :saw-vol         (:ar) - Use input amplitude to 
                           control saw amplitude 
  :sin-freq        (:ar) - Use input amplitude to 
                           control saw frequency 
******** dibrown
  :rand-walk       (:ar) - Random whole number 
                           walk through freqs with 
                           rate determined by 
                           mouse-x 
******** membrane-hexagon
  :mouse           (:kr) - Use mouse button, X and 
                           Y locations to play a 
                           drum. 
******** vosim
  :mouse1          (:ar) - Use mouse X location to 
                           control the frequency 
                           of the vosim. 
  :mouse2          (:ar) - Use the mouse X & Y 
                           location to modify some 
                           random vosim noises. 
******** membrane-circle
  :mouse           (:kr) - Use mouse button, X and 
                           Y locations to play a 
                           drum. 
******** dbrown
  :rand-walk       (:ar) - Random floating point 
                           number walk through 
                           freqs with rate 
                           determined by mouse-x 
******** dyn-klang
  :sin-osc         (:ar) - Use a sin-osc to change 
                           3 running sine 
                           oscillators 
******** dwhite
  :rand-seq        (:ar) - Play a random sequence 
                           of floats mapped to 
                           freqs with rate 
                           determined by mouse-x 
******** dyn-klank
  :mouse           (:ar) - Use mouse to change 3 
                           running frequency 
                           resonators 
******** compander
  :noise-gate      (:ar) - Use compander to create 
                           a noise gate 
  :data            (:ar) - View data coming out of 
                           a compander 
******** diwhite
  :rand-seq        (:ar) - Play a random sequence 
                           of integers mapped to 
                           freqs with rate 
                           determined by mouse-x 
******** b-moog
  :compare-filters (:ar) - Compare low, high, and 
                           bandpass 
******** iir-filter
  :low-pass        (:ar) - Create a low pass 
                           filter 

**** Synthesis:
-  [[oscillators]
-  [[filters]
-  [[delays] [empty]
-  [[envelopes and controls] [empty]
-  [[multi-channel expansion, stereo and panning]
-  [[fx chain] [fx chains]

