src/post_tonal_overtone/org_files/html-versions/personalized-overtone-wiki-in-one-file.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-12-02 Fri 16:35 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="b" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline13">1. outline of the overtone wiki page&#x2013;no code</a>
<ul>
<li><a href="#orgheadline12">1.1. Welcome to the Overtone Wiki</a>
<ul>
<li><a href="#orgheadline1">1.1.1. Technical Summary</a></li>
<li><a href="#orgheadline2">1.1.2. About this Documentation</a></li>
<li><a href="#orgheadline11">1.1.3. Contents</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline33">2. start with some basics of getting-started github wiki</a>
<ul>
<li><a href="#orgheadline14">2.1. define, start and kill a definst</a></li>
<li><a href="#orgheadline15">2.2. overtone documenation (odoc)</a></li>
<li><a href="#orgheadline16">2.3. providing arguments when defining synths with definst</a></li>
<li><a href="#orgheadline17">2.4. triggering multiple synths</a></li>
<li><a href="#orgheadline20">2.5. changing audio output levels on the fly</a>
<ul>
<li><a href="#orgheadline18">2.5.1. (doc ctl)</a></li>
<li><a href="#orgheadline19">2.5.2. my silly mod&#x2013;use <code>rand-nth</code> to change pitches using babel</a></li>
</ul>
</li>
<li><a href="#orgheadline32">2.6. ugens as input values to other ugens</a>
<ul>
<li><a href="#orgheadline21">2.6.1. line:kr for crescendo; sin-osc:kr for hz modulation</a></li>
<li><a href="#orgheadline30">2.6.2. white-noise:kr as hz modulator</a></li>
<li><a href="#orgheadline31">2.6.3. using <code>linen</code> for envelope generation</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline123">3. actual code contents: sections</a>
<ul>
<li><a href="#orgheadline61">3.1. synthesis</a>
<ul>
<li><a href="#orgheadline47">3.1.1. oscillators</a></li>
<li><a href="#orgheadline52">3.1.2. filtering</a></li>
<li><a href="#orgheadline60">3.1.3. multi-channel, stereo, panning</a></li>
</ul>
</li>
<li><a href="#orgheadline85">3.2. instruments and io</a>
<ul>
<li><a href="#orgheadline62">3.2.1. midi</a></li>
<li><a href="#orgheadline78">3.2.2. buffers and audio files</a></li>
<li><a href="#orgheadline84">3.2.3. recording</a></li>
</ul>
</li>
<li><a href="#orgheadline122">3.3. making 'music'</a>
<ul>
<li><a href="#orgheadline99">3.3.1. pitches and chords</a></li>
<li><a href="#orgheadline103">3.3.2. scales and scale degrees</a></li>
<li><a href="#orgheadline114">3.3.3. metronome and sequencing</a></li>
<li><a href="#orgheadline120">3.3.4. live coding</a></li>
<li><a href="#orgheadline121">3.3.5. swing</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline133">4. other misc</a>
<ul>
<li><a href="#orgheadline124">4.1. interupt output</a></li>
<li><a href="#orgheadline125">4.2. local audio files</a></li>
<li><a href="#orgheadline126">4.3. misc, non-wiki tutorials</a></li>
<li><a href="#orgheadline129">4.4. loading</a>
<ul>
<li><a href="#orgheadline127">4.4.1. loading 'external' resources</a></li>
<li><a href="#orgheadline128">4.4.2. loading files in CIDER</a></li>
</ul>
</li>
<li><a href="#orgheadline131">4.5. hacking overtone&#x2013;where do functions come from?</a>
<ul>
<li><a href="#orgheadline130">4.5.1. md</a></li>
</ul>
</li>
<li><a href="#orgheadline132">4.6. chris ford&#x2013;clojure cookbook example</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline13" class="outline-2">
<h2 id="orgheadline13"><span class="section-number-2">1</span> outline of the overtone wiki page&#x2013;no code</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">1.1</span> Welcome to the Overtone Wiki</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Our goal is to create a top notch live-coding environment and audio
collaboration platform that's free for everyone to download, hack on
and make crazy-cool sounds either individually or in groups. We've
come a long way towards achieving this vision and hope you'll join in
and help take things even further&#x2026;
</p>
</div>

<div id="outline-container-orgheadline1" class="outline-4">
<h4 id="orgheadline1"><span class="section-number-4">1.1.1</span> Technical Summary</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Overtone is a musical programming library written in
[Clojure](<a href="http://clojure.org">http://clojure.org</a>) which uses the
[SuperCollider](<a href="http://supercollider.sourceforge.net/">http://supercollider.sourceforge.net/</a>) audio engine
and synthesis server under the covers. We're essentially marrying an
awesome live-synthesis server with an insanely cool state-of-the-art
lisp to create a glorious union that only the Gods can dream about.
Seriously though, we're building on existing and proven open source
technologies to create something we're truly excited about.
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-4">
<h4 id="orgheadline2"><span class="section-number-4">1.1.2</span> About this Documentation</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
We will try to maintain documentation for all aspects of the system
here, but beyond the basics feel free to pick and choose the topics
that interest you. Some people might want to focus on synthesizing new
sounds from scratch, while for others it might be more interesting to
focus on live-coding or generating musical scores on the fly.
</p>

<p>
If you see any errors/issues/omissions, please feel free to fix/add
things - we'll love you forever.
</p>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-4">
<h4 id="orgheadline11"><span class="section-number-4">1.1.3</span> Contents</h4>
<div class="outline-text-4" id="text-1-1-3">
</div><ol class="org-ol"><li><a id="orgheadline3"></a>Installation<br  /><div class="outline-text-5" id="text-1-1-3-1">
<ul class="org-ul">
<li>[[Installing Overtone]</li>
<li>[[Starting a REPL]</li>
<li>[[Connecting scsynth]</li>
<li>[[Installing and Starting Jack] (for Linux users)</li>
<li>[[Overtone on the Edge!]</li>
<li>[[Overtone in emacs]</li>
<li>[[Overtone in vim]</li>
</ul>
</div></li>

<li><a id="orgheadline4"></a>First steps<br  /><div class="outline-text-5" id="text-1-1-3-2">
<ul class="org-ul">
<li>[Overtone Cheat Sheet](<a href="https://github.com/overtone/overtone/raw/master/docs/cheatsheet/overtone-cheat-sheet.pdf">https://github.com/overtone/overtone/raw/master/docs/cheatsheet/overtone-cheat-sheet.pdf</a>)</li>
<li>[[Getting Started]</li>
</ul>
</div></li>

<li><a id="orgheadline5"></a>Synthesis:<br  /><div class="outline-text-5" id="text-1-1-3-3">
<ul class="org-ul">
<li>[[oscillators]</li>
<li>[[filters]</li>
<li>[[delays] [empty]</li>
<li>[[envelopes and controls] [empty]</li>
<li>[[multi-channel expansion, stereo and panning]</li>
<li>[[fx chain] [fx chains]</li>
</ul>
</div></li>
