docs/orzo/multi-part-overtone-tutorial/personalized-overtone-wiki-in-one-file.org
**** Instruments and I/O:
-  [[buffers and audio files]
-  [[midi]
-  [[recording]
-  [[screencasting]

**** Making music:
***** [[Pitches and Chords]
Contains the template for creating "timed" chord progressions
***** [[Scales and Scale Degrees]
Examples of using (a horrible) "scale degree" keyword notation with a
"rest" notation for presumably playing melodies
***** [[Metronome and Sequencing]
***** [[Arpeggiators and Note Generators][empty]
***** [[live-coding]
***** [[swing]

**** Interacting with External Devices:
-  [[Monome][empty]
-  [[TouchOSC]

**** In progress:
-  [[sessions and instruments][empty]

**** Development:
-  [[Bug Reports]
-  [[Hacking Overtone]
-  [[Comparing sclang and Overtone synthdefs]

* getting-started page contents
:PROPERTIES:
:ID:       51BA5E52-D1FB-4C62-AA7C-E83825E001C0
:END:
** define, start and kill a definst
first, maybe set a name-space

reconsider evaluating this as is. More reliable to have already taken
care of the namespace using a single method that I have talked about
in my other files. [Uh, see "other files"]

However, you will likely want to switch into the post_tonal namespace
to run things here. Additionally, you will want to call this in the
repl as well (why did things just automatically sorta happen in the repl?)
 #+BEGIN_SRC clojure :session getting-started
(in-ns 'post_tonal_overtone.core)
 #+END_SRC

 #+RESULTS:
 : #<Namespace post_tonal_overtone.core>



#+BEGIN_SRC clojure :results silent
(definst foo [] (saw 110))
(definst foo2 [] (square 300))
#+END_SRC

#+BEGIN_SRC clojure
(demo (foo))
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: user/audition-synth 229>

#+BEGIN_SRC clojure :results output
(demo (foo2))
#+END_SRC

#+RESULTS:

#+BEGIN_SRC clojure
*demo-time*
#+END_SRC
#+RESULTS:
: 2000

#+BEGIN_SRC clojure :session getting-started
(stop)
#+END_SRC

#+RESULTS:
: nil

Kill by ID number, as returned above
#+BEGIN_SRC clojure :session getting-started
(kill 74)
#+END_SRC

#+BEGIN_SRC clojure
(kill foo)
(kill foo2)
#+END_SRC

#+RESULTS:
: nilnil
** overtone documenation (odoc)
must be called from the REPL; in babel it simply prints its return
value, which is nil
#+BEGIN_SRC clojure :session getting-started
(odoc saw)
#+END_SRC

#+RESULTS:
: nil
** providing arguments when defining synths with definst
#+BEGIN_SRC clojure :session getting-started
;; rather loud!
(definst bar [freq 220] (saw freq))

(bar 110)
#+END_SRC

#+RESULTS:
: #<instrument: bar>#<synth-node[loading]: post_tonal_overtone.core/bar 73>

Kill all versions of one type of synth
#+BEGIN_SRC clojure :session getting-started
(kill bar)
#+END_SRC

#+RESULTS:
: nil

#+BEGIN_SRC clojure :session getting-started
(stop)
#+END_SRC

#+RESULTS:
: nil

** triggering multiple synths
#+BEGIN_SRC clojure :session getting-started
(definst baz [freq 440] (* 0.3 (saw freq)))
(baz 220)
(baz 825)
#+END_SRC

#+RESULTS:
: #<instrument: baz>#<synth-node[loading]: post_tonal_overtone.core/baz 119>#<synth-node[loading]: post_tonal_overtone.core/baz 120>

#+BEGIN_SRC clojure :session getting-started
(kill baz)
#+END_SRC

#+RESULTS:
: nil

** changing audio output levels on the fly
*** (doc ctl)
#+BEGIN_SRC clojure :session getting-started
(definst quux [freq 440] (* 0.3 (saw freq)))
(quux)
#+END_SRC

#+RESULTS:
: #<instrument: quux>#<synth-node[loading]: post_tonal_overtone.core/quux 125>

#+BEGIN_SRC clojure :session getting-started
(ctl quux :freq 660)
#+END_SRC

#+RESULTS:
: #overtone.studio.inst.Inst{:name "quux", :params ({:value #<Atom@740512ef: 440.0>, :name "freq", :default 440.0, :rate :kr}), :args ("freq"), :sdef {:name "post_tonal_overtone.core/quux", :constants [60.0 0.3], :params (440.0), :pnames ({:name "freq", :index 0}), :ugens ({:args nil, :special 0, :name "Control", :rate 1, :inputs (), :rate-name :kr, :n-outputs 1, :id 369, :outputs ({:rate 1}), :n-inputs 0} #<sc-ugen: saw:ar [1]> #<sc-ugen: binary-op-u-gen:ar [2]> #<sc-ugen: out:ar [3]>)}, :group #<synth-group[live]: Inst quux Container 121>, :instance-group #<synth-group[live]: Inst quux 122>, :fx-group #<synth-group[live]: Inst quux FX 123>, :mixer #<synth-node[live]: overtone.stu547/mono-inst-mixer 124>, :bus #<audio-bus: No Name, mono, id 60>, :fx-chain [], :volume #<Atom@791e446a: 1.0>, :pan #<Atom@321dc945: 0.0>, :n-chans 1}
*** my silly mod--use ~rand-nth~ to change pitches using babel
#+BEGIN_SRC clojure :session getting-started
(definst quux [freq 440] (* 0.3 (saw freq)))
(quux)
#+END_SRC

#+RESULTS:
: #<instrument: quux>#<synth-node[loading]: post_tonal_overtone.core/quux 126>

 #+BEGIN_SRC clojure :session getting-started
(ctl quux :freq (rand-nth '(330 550 660 825 910)))
 #+END_SRC

 #+RESULTS:
 : #overtone.studio.inst.Inst{:name "quux", :params ({:value #<Atom@7340ba67: 440.0>, :name "freq", :default 440.0, :rate :kr}), :args ("freq"), :sdef {:name "post_tonal_overtone.core/quux", :constants [60.0 0.3], :params (440.0), :pnames ({:name "freq", :index 0}), :ugens ({:args nil, :special 0, :name "Control", :rate 1, :inputs (), :rate-name :kr, :n-outputs 1, :id 373, :outputs ({:rate 1}), :n-inputs 0} #<sc-ugen: saw:ar [1]> #<sc-ugen: binary-op-u-gen:ar [2]> #<sc-ugen: out:ar [3]>)}, :group #<synth-group[live]: Inst quux Container 121>, :instance-group #<synth-group[live]: Inst quux 122>, :fx-group #<synth-group[live]: Inst quux FX 123>, :mixer #<synth-node[live]: overtone.stu547/mono-inst-mixer 124>, :bus #<audio-bus: No Name, mono, id 60>, :fx-chain [], :volume #<Atom@1e8dfb4e: 1.0>, :pan #<Atom@7b6dcd8d: 0.0>, :n-chans 1}
** ugens as input values to other ugens
*** line:kr for crescendo; sin-osc:kr for hz modulation
#+BEGIN_SRC clojure :session getting-started
(definst trem [freq 440 depth 10 rate 6 length 5]
  (* 0.3
     (line:kr 0 1 length FREE)
     (saw (+ freq (* depth (sin-osc:kr rate))))))

(trem)
#+END_SRC

#+RESULTS:
: #<instrument: trem>#<synth-node[loading]: post_tonal_overtone.core/trem 9676>


#+BEGIN_SRC clojure :session getting-started
(trem 200 60 0.8)
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: post_tonal_overtone.core/trem 132>

#+BEGIN_SRC clojure :session getting-started
(trem 60 30 0.2)
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: post_tonal_overtone.core/trem 133>

doesn't expand??
#+BEGIN_SRC clojure :session getting-started
(trem :freq [60 64])
#+END_SRC

#+RESULTS:

*** white-noise:kr as hz modulator
**** simple version, beautiful
#+BEGIN_SRC clojure :session getting-started
(definst sin-noise [freq 440 depth 50 length 10]
  (* 0.3
     (line:kr 0 1 length FREE)
     (sin-osc (+ freq (* depth (white-noise:kr))))))

;;(doseq [note [200 300 400 500 600 700 800]] (sin-noise note))
(doseq [note [440 810]] (sin-noise note))
#+END_SRC

#+RESULTS:
: #<instrument: sin-noise>nil
