src/post_tonal_overtone/org_files/html-versions/personalized-overtone-wiki-in-one-file.html

<li><a id="orgheadline6"></a>Instruments and I/O:<br  /><div class="outline-text-5" id="text-1-1-3-4">
<ul class="org-ul">
<li>[[buffers and audio files]</li>
<li>[[midi]</li>
<li>[[recording]</li>
<li>[[screencasting]</li>
</ul>
</div></li>

<li><a id="orgheadline7"></a>Making music:<br  /><div class="outline-text-5" id="text-1-1-3-5">
<ul class="org-ul">
<li>[[Pitches and Chords]</li>
<li>[[Scales and Scale Degrees]</li>
<li>[[Metronome and Sequencing]</li>
<li>[[Arpeggiators and Note Generators][empty]</li>
<li>[[live-coding]</li>
<li>[[swing]</li>
</ul>
</div></li>

<li><a id="orgheadline8"></a>Interacting with External Devices:<br  /><div class="outline-text-5" id="text-1-1-3-6">
<ul class="org-ul">
<li>[[Monome][empty]</li>
<li>[[TouchOSC]</li>
</ul>
</div></li>

<li><a id="orgheadline9"></a>In progress:<br  /><div class="outline-text-5" id="text-1-1-3-7">
<ul class="org-ul">
<li>[[sessions and instruments][empty]</li>
</ul>
</div></li>

<li><a id="orgheadline10"></a>Development:<br  /><div class="outline-text-5" id="text-1-1-3-8">
<ul class="org-ul">
<li>[[Bug Reports]</li>
<li>[[Hacking Overtone]</li>
<li>[[Comparing sclang and Overtone synthdefs]</li>
</ul>
</div></li></ol>
</div>
</div>
</div>

<div id="outline-container-orgheadline33" class="outline-2">
<h2 id="orgheadline33"><span class="section-number-2">2</span> start with some basics of getting-started github wiki</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14"><span class="section-number-3">2.1</span> define, start and kill a definst</h3>
<div class="outline-text-3" id="text-2-1">
<p>
first, maybe set a name-space
</p>

<p>
reconsider evaluating this as is. More reliable to have already taken
care of the namespace using a single method that I have talked about
in my other files. [Uh, see "other files"]
</p>

<p>
However, you will likely want to switch into the post<sub>tonal</sub> namespace
to run things here. Additionally, you will want to call this in the
repl as well (why did things just automatically sorta happen in the repl?)
</p>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">in-ns</span> '<span style="color: #7CB8BB;">post_tonal_overtone.core</span>)
</pre>
</div>



<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">foo</span> [] (saw 220))

(demo (foo))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(stop)
</pre>
</div>

<p>
Kill by ID number, as returned above
</p>
<div class="org-src-container">

<pre class="src src-clojure">(kill 74)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(kill foo)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15"><span class="section-number-3">2.2</span> overtone documenation (odoc)</h3>
<div class="outline-text-3" id="text-2-2">
<p>
must be called from the REPL; in babel it simply prints its return
value, which is nil
</p>
<div class="org-src-container">

<pre class="src src-clojure">(odoc saw)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16"><span class="section-number-3">2.3</span> providing arguments when defining synths with definst</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">rather loud!</span>
(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">bar</span> [freq 220] (saw freq))

(bar 110)
</pre>
</div>

<p>
Kill all versions of one type of synth
</p>
<div class="org-src-container">

<pre class="src src-clojure">(kill bar)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(stop)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline17" class="outline-3">
<h3 id="orgheadline17"><span class="section-number-3">2.4</span> triggering multiple synths</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">baz</span> [freq 440] (* 0.3 (saw freq)))
(baz 220)
(baz 825)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(kill baz)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline20" class="outline-3">
<h3 id="orgheadline20"><span class="section-number-3">2.5</span> changing audio output levels on the fly</h3>
<div class="outline-text-3" id="text-2-5">
</div><div id="outline-container-orgheadline18" class="outline-4">
<h4 id="orgheadline18"><span class="section-number-4">2.5.1</span> (doc ctl)</h4>
<div class="outline-text-4" id="text-2-5-1">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">quux</span> [freq 440] (* 0.3 (saw freq)))
(quux)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(ctl quux <span style="color: #BFEBBF;">:freq</span> 660)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline19" class="outline-4">
<h4 id="orgheadline19"><span class="section-number-4">2.5.2</span> my silly mod&#x2013;use <code>rand-nth</code> to change pitches using babel</h4>
<div class="outline-text-4" id="text-2-5-2">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">quux</span> [freq 440] (* 0.3 (saw freq)))
(quux)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(ctl quux <span style="color: #BFEBBF;">:freq</span> (rand-nth '(330 550 660 825 910)))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline32" class="outline-3">
<h3 id="orgheadline32"><span class="section-number-3">2.6</span> ugens as input values to other ugens</h3>
<div class="outline-text-3" id="text-2-6">
</div><div id="outline-container-orgheadline21" class="outline-4">
<h4 id="orgheadline21"><span class="section-number-4">2.6.1</span> line:kr for crescendo; sin-osc:kr for hz modulation</h4>
<div class="outline-text-4" id="text-2-6-1">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">trem</span> [freq 440 depth 10 rate 6 length 5]
  (* 0.3
     (line:kr 0 1 length <span style="color: #BFEBBF;">FREE</span>)
     (saw (+ freq (* depth (sin-osc:kr rate))))))

(trem)
</pre>
</div>


<div class="org-src-container">

<pre class="src src-clojure">(trem 200 60 0.8)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(trem 60 30 0.2)
</pre>
</div>

<p>
doesn't expand??
</p>
<div class="org-src-container">

<pre class="src src-clojure">(trem <span style="color: #BFEBBF;">:freq</span> [60 64])
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline30" class="outline-4">
<h4 id="orgheadline30"><span class="section-number-4">2.6.2</span> white-noise:kr as hz modulator</h4>
<div class="outline-text-4" id="text-2-6-2">
</div><ol class="org-ol"><li><a id="orgheadline22"></a>simple version, beautiful<br  /><div class="outline-text-5" id="text-2-6-2-1">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">sin-noise</span> [freq 440 depth 50 length 10]
  (* 0.3
     (line:kr 0 1 length <span style="color: #BFEBBF;">FREE</span>)
     (sin-osc (+ freq (* depth (white-noise:kr))))))

<span style="color: #5F7F5F;">;;</span><span style="color: #7F9F7F;">(doseq [note [200 300 400 500 600 700 800]] (sin-noise note))</span>
(<span style="color: #F0DFAF; font-weight: bold;">doseq</span> [note [440 810]] (sin-noise note))
</pre>
</div>
</div></li>
