docs/orzo/multi-part-overtone-tutorial/personalized-overtone-wiki-in-one-file.org
**** 60 second version, depth of 100--pitch fully obscured
#+BEGIN_SRC clojure :session getting-started
(definst sin-noise [freq 440 depth 100 length 60]
  (* 0.1
     (line:kr 0 1 length FREE)
     (sin-osc (+ freq (* depth (white-noise:kr))))))

;;(doseq [note [200 300 400 500 600 700 800]] (sin-noise note))
(doseq [note (map #(+ % 400 ) (repeatedly 10 (partial rand-int 100)))] (sin-noise note))
#+END_SRC

#+RESULTS:
: #<instrument: sin-noise>nil

#+BEGIN_SRC clojure :session getting-started
(definst sin-noise [freq 440 depth 100 length 60]
  (* 0.05
     (line:kr 0 1 length FREE)
     (sin-osc (+ freq (* depth (white-noise:kr))))))

;;(doseq [note [200 300 400 500 600 700 800]] (sin-noise note))
(doseq [note (map #(+ % 400 ) (repeatedly 10 (partial rand-int 100)))] (sin-noise note))
#+END_SRC

#+RESULTS:
: #<instrument: sin-noise>nil

**** call sin-noise in a noise-cloud, takes a central pitch
#+BEGIN_SRC clojure :session getting-started
(definst sin-noise [freq 440 depth 100 length 60]
  (* 0.3
     (line:kr 0 1 length FREE)
     (sin-osc (+ freq (* depth (white-noise:kr))))))


(defn sin-noise-cloud1 [hz-level hz-span pitches]
  (doseq [note (map #(+ % hz-level) (repeatedly pitches (partial rand-int hz-span)))]
    (sin-noise note)))

(sin-noise-cloud1 400 1000 5)
#+END_SRC

**** (sin-noise-cloud1 400 10 5)

#+BEGIN_SRC clojure :session getting-started
(sin-noise-cloud1 400 10 5)
#+END_SRC
#+RESULTS:
: nil

**** longer quieter version
#+BEGIN_SRC clojure :session getting-started
(definst sin-noise [freq 440 depth 100 length 
  (* 0.1
     (line:kr 0 1 length FREE)
     (sin-osc (+ freq (* depth (white-noise:kr))))))


(defn sin-noise-cloud1 [hz-level hz-span pitches]
  (doseq [note (map #(+ % hz-level) (repeatedly pitches (partial rand-int hz-span)))]
    (sin-noise note)))

(sin-noise-cloud1 400 1000 5)
#+END_SRC

#+RESULTS:
: #'post_tonal_overtone.core/sin-noise-cloud1nil

**** give noise-cloud a proper envelope with env-gen (which takes a lin)
#+BEGIN_SRC clojure :session getting-started
(definst sin-noise-env [freq 440 depth 10 length 60]
  (* 0.3
     (env-gen (lin 0 0.8 0.2) 1 1 0 10 FREE)
     (sin-osc (+ freq (* depth (white-noise:kr))))))


(defn sin-noise-cloud2 [hz-level hz-span pitches]
  (doseq [note (map #(+ % hz-level) (repeatedly pitches (partial rand-int hz-span)))]
    (sin-noise-env note)))

(sin-noise-cloud2 400 1000 5)
#+END_SRC

**** (sin-noise-cloud2 400 100 3)
#+BEGIN_SRC clojure :session vle
(sin-noise-cloud2 400 100 3)
#+END_SRC
#+RESULTS:
: nil

#+BEGIN_SRC clojure :session getting-started
(definst sin-noise-env [freq 440 depth 10 length 60]
  (* 0.3
     (env-gen (lin 0 0.8 0.2) 1 1 0 10 FREE)
     (sin-osc (+ freq (* depth (white-noise:kr))))))


(defn sin-noise-cloud3 [hz-level hz-span pitches]
  (doseq [note (map #(+ % hz-level) (repeatedly pitches (partial rand-int hz-span)))]
    (sin-noise-env note :length 10)))

(sin-noise-cloud3 400 1000 5)
#+END_SRC

**** (sin-noise-cloud3 400 50 3)
#+BEGIN_SRC clojure :session vle
(sin-noise-cloud3 400 50 3)
#+END_SRC
#+RESULTS:
: nil

*** using ~linen~ for envelope generation
#+BEGIN_SRC clojure :session getting-started
(linen 1.0 0.01 1.0 1.0 0)
#+END_SRC

#+RESULTS:
: #<sc-ugen: linen:kr [0]>
* additional sections
** synthesis
*** oscillators
**** half-second examples of various wave types
  These are all very short examples of these sounds. Why so short? Or
  how would you experiment with different lengths?

  You'll have to dig more deeply into ~env-gen~ which is used to scale
  the output of ~sin-osc~ and ~vol~

  We'll look at this in a dedicated 'envelopes' section.
***** sin wave
   #+BEGIN_SRC clojure :session getting-started
(definst sin-wave [freq 440 attack 0.01 sustain 0.4 release 0.1 vol 0.4] 
  (* (env-gen (lin attack sustain release) 1 1 0 1 FREE)
     (sin-osc freq)
     vol))

(sin-wave)
   #+END_SRC

   #+RESULTS:
   : #<instrument: sin-wave>#<synth-node[loading]: post_tonal_overtone485/sin-wave 149>
***** saw wave
   #+BEGIN_SRC clojure :session getting-started
(definst saw-wave [freq 440 attack 0.01 sustain 0.4 release 0.1 vol 0.4] 
  (* (env-gen (lin attack sustain release) 1 1 0 1 FREE)
     (saw freq)
     vol))

(saw-wave)
   #+END_SRC

   #+RESULTS:
   : #<instrument: saw-wave>#<synth-node[loading]: post_tonal_overtone485/saw-wave 154>
***** square-wave
   #+BEGIN_SRC clojure :session getting-started
(definst square-wave [freq 440 attack 0.01 sustain 0.4 release 0.1 vol 0.4] 
  (* (env-gen (lin attack sustain release) 1 1 0 1 FREE)
     (lf-pulse:ar freq)
     vol))

(square-wave)
   #+END_SRC

   #+RESULTS:
   : #<instrument: square-wave>#<synth-node[loading]: post_tonal_overt485/square-wave 159>
***** pink noise
   #+BEGIN_SRC clojure :session getting-started
(definst noisey [freq 440 attack 0.01 sustain 0.4 release 0.1 vol 0.4] 
  (* (env-gen (lin attack sustain release) 1 1 0 1 FREE)
     (pink-noise) ; also have (white-noise) and others...
     vol))

(noisey)

   #+END_SRC

   #+RESULTS:
   : #<instrument: noisey>#<synth-node[loading]: post_tonal_overtone.c485/noisey 164>
***** triangle-wave
   #+BEGIN_SRC clojure :session getting-started
(definst triangle-wave [freq 440 attack 0.01 sustain 0.1 release 0.4 vol 0.4] 
  (* (env-gen (lin attack sustain release) 1 1 0 1 FREE)
     (lf-tri freq)
     vol))

(triangle-wave)
   #+END_SRC


   #+RESULTS:
   : #<instrument: triangle-wave>#<synth-node[loading]: post_tonal_ove485/triangle-wave 169>
**** using the output of ugens as the arguments
***** understanding uses for ugens
  Aside from giving static numeric values as arguments for frequency,
  amplitude and the other parameters you typically control, you might
  also choose to use dynamic values, i.e. values that change according
  to some pattern or system.

  ~Spooky house~ below is one such example.
