src/post_tonal_overtone/org_files/html-versions/personalized-overtone-wiki-in-one-file.html
<li><a id="orgheadline23"></a>60 second version, depth of 100&#x2013;pitch fully obscured<br  /><div class="outline-text-5" id="text-2-6-2-2">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">sin-noise</span> [freq 440 depth 100 length 60]
  (* 0.1
     (line:kr 0 1 length <span style="color: #BFEBBF;">FREE</span>)
     (sin-osc (+ freq (* depth (white-noise:kr))))))

<span style="color: #5F7F5F;">;;</span><span style="color: #7F9F7F;">(doseq [note [200 300 400 500 600 700 800]] (sin-noise note))</span>
(<span style="color: #F0DFAF; font-weight: bold;">doseq</span> [note (map #(+ <span style="color: #DFAF8F;">%</span> 400 ) (repeatedly 10 (partial rand-int 100)))] (sin-noise note))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">sin-noise</span> [freq 440 depth 100 length 60]
  (* 0.05
     (line:kr 0 1 length <span style="color: #BFEBBF;">FREE</span>)
     (sin-osc (+ freq (* depth (white-noise:kr))))))

<span style="color: #5F7F5F;">;;</span><span style="color: #7F9F7F;">(doseq [note [200 300 400 500 600 700 800]] (sin-noise note))</span>
(<span style="color: #F0DFAF; font-weight: bold;">doseq</span> [note (map #(+ <span style="color: #DFAF8F;">%</span> 400 ) (repeatedly 10 (partial rand-int 100)))] (sin-noise note))
</pre>
</div>
</div></li>

<li><a id="orgheadline24"></a>call sin-noise in a noise-cloud, takes a central pitch<br  /><div class="outline-text-5" id="text-2-6-2-3">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">sin-noise</span> [freq 440 depth 100 length 60]
  (* 0.3
     (line:kr 0 1 length <span style="color: #BFEBBF;">FREE</span>)
     (sin-osc (+ freq (* depth (white-noise:kr))))))


(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">sin-noise-cloud1</span> [hz-level hz-span pitches]
  (<span style="color: #F0DFAF; font-weight: bold;">doseq</span> [note (map #(+ <span style="color: #DFAF8F;">%</span> hz-level) (repeatedly pitches (partial rand-int hz-span)))]
    (sin-noise note)))

(sin-noise-cloud1 400 1000 5)
</pre>
</div>
</div></li>

<li><a id="orgheadline25"></a>(sin-noise-cloud1 400 10 5)<br  /><div class="outline-text-5" id="text-2-6-2-4">
<div class="org-src-container">

<pre class="src src-clojure">(sin-noise-cloud1 400 10 5)
</pre>
</div>
</div></li>
<li><a id="orgheadline26"></a>longer quieter version<br  /><div class="outline-text-5" id="text-2-6-2-5">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">sin-noise</span> [freq 440 depth 100 length 
  (* 0.1
     (line:kr 0 1 length <span style="color: #BFEBBF;">FREE</span>)
     (sin-osc (+ freq (* depth (white-noise:kr))))))


(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">sin-noise-cloud1</span> [hz-level hz-span pitches]
  (<span style="color: #F0DFAF; font-weight: bold;">doseq</span> [note (map #(+ <span style="color: #DFAF8F;">%</span> hz-level) (repeatedly pitches (partial rand-int hz-span)))]
    (sin-noise note)))

(sin-noise-cloud1 400 1000 5)
</pre>
</div>
</div></li>

<li><a id="orgheadline27"></a>give noise-cloud a proper envelope with env-gen (which takes a lin)<br  /><div class="outline-text-5" id="text-2-6-2-6">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">sin-noise-env</span> [freq 440 depth 10 length 60]
  (* 0.3
     (env-gen (lin 0 0.8 0.2) 1 1 0 10 <span style="color: #BFEBBF;">FREE</span>)
     (sin-osc (+ freq (* depth (white-noise:kr))))))


(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">sin-noise-cloud2</span> [hz-level hz-span pitches]
  (<span style="color: #F0DFAF; font-weight: bold;">doseq</span> [note (map #(+ <span style="color: #DFAF8F;">%</span> hz-level) (repeatedly pitches (partial rand-int hz-span)))]
    (sin-noise-env note)))

(sin-noise-cloud2 400 1000 5)
</pre>
</div>
</div></li>

<li><a id="orgheadline28"></a>(sin-noise-cloud2 400 100 3)<br  /><div class="outline-text-5" id="text-2-6-2-7">
<div class="org-src-container">

<pre class="src src-clojure">(sin-noise-cloud2 400 100 3)
</pre>
</div>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">sin-noise-env</span> [freq 440 depth 10 length 60]
  (* 0.3
     (env-gen (lin 0 0.8 0.2) 1 1 0 10 <span style="color: #BFEBBF;">FREE</span>)
     (sin-osc (+ freq (* depth (white-noise:kr))))))


(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">sin-noise-cloud3</span> [hz-level hz-span pitches]
  (<span style="color: #F0DFAF; font-weight: bold;">doseq</span> [note (map #(+ <span style="color: #DFAF8F;">%</span> hz-level) (repeatedly pitches (partial rand-int hz-span)))]
    (sin-noise-env note <span style="color: #BFEBBF;">:length</span> 10)))

(sin-noise-cloud3 400 1000 5)
</pre>
</div>
</div></li>

<li><a id="orgheadline29"></a>(sin-noise-cloud3 400 50 3)<br  /><div class="outline-text-5" id="text-2-6-2-8">
<div class="org-src-container">

<pre class="src src-clojure">(sin-noise-cloud3 400 50 3)
</pre>
</div>
</div></li></ol>
</div>
<div id="outline-container-orgheadline31" class="outline-4">
<h4 id="orgheadline31"><span class="section-number-4">2.6.3</span> using <code>linen</code> for envelope generation</h4>
<div class="outline-text-4" id="text-2-6-3">
<div class="org-src-container">

<pre class="src src-clojure">(linen 1.0 0.01 1.0 1.0 0)
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline123" class="outline-2">
<h2 id="orgheadline123"><span class="section-number-2">3</span> actual code contents: sections</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline61" class="outline-3">
<h3 id="orgheadline61"><span class="section-number-3">3.1</span> synthesis</h3>
<div class="outline-text-3" id="text-3-1">
</div><div id="outline-container-orgheadline47" class="outline-4">
<h4 id="orgheadline47"><span class="section-number-4">3.1.1</span> oscillators</h4>
<div class="outline-text-4" id="text-3-1-1">
</div><ol class="org-ol"><li><a id="orgheadline39"></a>half-second examples of various wave types<br  /><div class="outline-text-5" id="text-3-1-1-1">
<p>
These are all very short examples of these sounds. Why so short? Or
how would you experiment with different lengths?
</p>

<p>
You'll have to dig more deeply into <code>env-gen</code> which is used to scale
the output of <code>sin-osc</code> and <code>vol</code>
</p>

<p>
We'll look at this in a dedicated 'envelopes' section.
</p>
</div>
<ol class="org-ol"><li><a id="orgheadline34"></a>sin wave<br  /><div class="outline-text-6" id="text-3-1-1-1-1">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">sin-wave</span> [freq 440 attack 0.01 sustain 0.4 release 0.1 vol 0.4] 
  (* (env-gen (lin attack sustain release) 1 1 0 1 <span style="color: #BFEBBF;">FREE</span>)
     (sin-osc freq)
     vol))

(sin-wave)
</pre>
</div>
</div></li>
<li><a id="orgheadline35"></a>saw wave<br  /><div class="outline-text-6" id="text-3-1-1-1-2">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">saw-wave</span> [freq 440 attack 0.01 sustain 0.4 release 0.1 vol 0.4] 
  (* (env-gen (lin attack sustain release) 1 1 0 1 <span style="color: #BFEBBF;">FREE</span>)
     (saw freq)
     vol))

(saw-wave)
</pre>
</div>
</div></li>
<li><a id="orgheadline36"></a>square-wave<br  /><div class="outline-text-6" id="text-3-1-1-1-3">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">square-wave</span> [freq 440 attack 0.01 sustain 0.4 release 0.1 vol 0.4] 
  (* (env-gen (lin attack sustain release) 1 1 0 1 <span style="color: #BFEBBF;">FREE</span>)
     (lf-pulse:ar freq)
     vol))

(square-wave)
</pre>
</div>
</div></li>
<li><a id="orgheadline37"></a>pink noise<br  /><div class="outline-text-6" id="text-3-1-1-1-4">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">noisey</span> [freq 440 attack 0.01 sustain 0.4 release 0.1 vol 0.4] 
  (* (env-gen (lin attack sustain release) 1 1 0 1 <span style="color: #BFEBBF;">FREE</span>)
     (pink-noise) <span style="color: #7F9F7F;">; also have (white-noise) and others...</span>
     vol))

(noisey)
</pre>
</div>
</div></li>
<li><a id="orgheadline38"></a>triangle-wave<br  /><div class="outline-text-6" id="text-3-1-1-1-5">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">triangle-wave</span> [freq 440 attack 0.01 sustain 0.1 release 0.4 vol 0.4] 
  (* (env-gen (lin attack sustain release) 1 1 0 1 <span style="color: #BFEBBF;">FREE</span>)
     (lf-tri freq)
     vol))

(triangle-wave)
</pre>
</div>
</div></li></ol></li>

<li><a id="orgheadline46"></a>using the output of ugens as the arguments<br  /><ol class="org-ol"><li><a id="orgheadline40"></a>understanding uses for ugens<br  /><div class="outline-text-6" id="text-3-1-1-2-1">
<p>
Aside from giving static numeric values as arguments for frequency,
amplitude and the other parameters you typically control, you might
also choose to use dynamic values, i.e. values that change according
to some pattern or system.
</p>

<p>
<code>Spooky house</code> below is one such example.
</p>
</div></li>
