docs/orzo/multi-part-overtone-tutorial/personalized-overtone-wiki-in-one-file.org
***** ugens as control signals
   Here is an adjustable width pulse wave shifting the frequency of the
   main oscillator

   #+BEGIN_SRC clojure :session getting-started
(definst spooky-house [freq 440 width 0.2
                       attack 0.3 sustain 4
                       release 0.3 vol 0.4]
  (* (env-gen (lin attack sustain release) 1 1 0 1 FREE)
     (sin-osc (+ freq (* 20 (lf-pulse:kr 0.5 0 width))))
     vol))

(spooky-house)
   #+END_SRC

   #+RESULTS:
   : #<instrument: spooky-house>#<synth-node[loading]: post_tonal_over485/spooky-house 174>

   #+BEGIN_SRC clojure :session getting-started
(spooky-house :width 0.1)
   #+END_SRC

***** wavetable synthesis
****** No examples of this

    "In wavetable synthesis, a single period waveform is stored in a
    buffer and used as a lookup table for the osc osciallator."

    Great, thanks.
****** experiments
******* [#A] my lf-noise
   #+BEGIN_SRC clojure :results silent
(definst my-dynamic-spooky-house [freq 440 width 0.2
                       attack 0.3 sustain 4
                       release 0.3 vol 0.4]
  (* (env-gen (lin attack sustain release) 1 1 0 1 FREE)
     (sin-osc (+ freq (* 20 (lf-noise1:kr 100))))
     vol))

(my-dynamic-spooky-house)
   #+END_SRC

Note, approximately 14 second long, as suggested by the integers used
as arguments for the env-gen

  #+BEGIN_SRC  clojure
(my-dynamic :attack 2 :sustain 10 :release 4)
  #+END_SRC

  #+RESULTS:
  : #<synth-node[loading]: user/my-dynamic 173>

*** filtering
**** linear filters
  Overtone comes with a number of standard linear filters: lpf, hpf, and
  bpf are low-pass, high-pass and band-pass filters respectively.
***** use mouse-x interactively
  #+BEGIN_SRC clojure :session getting-started
(demo 10 (lpf (saw 100) (mouse-x 40 5000 EXP)))
;; low-pass; move the mouse left and right to change the threshold frequency

  #+END_SRC

  #+RESULTS:
  : #<synth-node[loading]: post_tonal_ov485/audition-synth 2266>

  #+BEGIN_SRC clojure :session getting-started
(demo 10 (hpf (saw 100) (mouse-x 40 5000 EXP)))
;; high-pass; move the mouse left and right to change the threshold frequency

  #+END_SRC

  #+RESULTS:
  : #<synth-node[loading]: post_tonal_ov485/audition-synth 2267>

  #+BEGIN_SRC clojure :session getting-started
(demo 30 
      (bpf (saw 100)
           (mouse-x 40 5000 EXP)
           (mouse-y 0.01 1 LIN)))
;; band-pass; move mouse left/right to change threshold frequency; up/down to change bandwidth (top is narrowest)
  #+END_SRC

  #+RESULTS:
  : #<synth-node[loading]: post_tonal_ov485/audition-synth 2268>
***** band-pass
move mouse left/right to change threshold frequency; up/down to change bandwidth (top is narrowest)

  #+BEGIN_SRC clojure
(demo 30 (bpf (pink-noise) (mouse-x 40 5000 EXP) (mouse-y 0.01 1 LIN)))
  #+END_SRC

  #+RESULTS:
  : #<synth-node[loading]: user/audition-synth 174>

poses the question, what are the standard x-left x-right and y-top
y-bottom values which these functions are mapping?
**** non-linear filters
  You can do Karplus-Strong string synthesis with the pluck filter.
  Karplus-Strong works by taking a signal, filtering it and feeding it
  back into itself after a delay, so that the output eventually becomes
  periodic.

here we generate a pulse of white noise, and pass it through a pluck
filter with a delay based on the given frequency

 #+BEGIN_SRC clojure

(let [freq (rand-nth '(440 550 660 770 880 990 1100 1210 1320))]
   (demo (pluck (* (white-noise) (env-gen (perc 0.001 2) :action FREE)) 1 3 (/ 1 freq))))
  #+END_SRC

  #+RESULTS:
  : #<synth-node[loading]: user/audition-synth 205>
*** multi-channel, stereo, panning
**** mono defsynth
***** left = 0
#+BEGIN_SRC clojure :session getting-started
(demo (out 0 (sin-osc)))
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: post_tonal_ov485/audition-synth 9760>
***** right = 1
#+BEGIN_SRC clojure :session getting-started
(demo (out 1 (sin-osc)))
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: post_tonal_ov485/audition-synth 9761>
***** sin0 and sin1
  #+BEGIN_SRC clojure :session getting-started
(defsynth sin0 [freq 660]
  (out 0 (sin-osc freq)))

(sin0)
  #+END_SRC

  #+RESULTS:
  : #<synth: sin0>#<synth-node[loading]: post_tonal_ov485/audition-synth 9769>


  #+BEGIN_SRC clojure :session getting-started
(defsynth sin1 [freq 660]
  (out 1 (sin-osc freq)))

(demo (sin1))
  #+END_SRC

  #+RESULTS:
  : #<synth: sin1>#<synth-node[loading]: post_tonal_overtone.core/sin1 57>

**** stereo defsynth--takes 'two & body' parameters
  #+BEGIN_SRC clojure :session getting-started
(defsynth sin2 [freq1 440 freq2 441]
  (out 0 (sin-osc freq1))
  (out 1 (sin-osc freq2)))

(demo (sin2))
  #+END_SRC

  #+RESULTS:
  : #<synth: sin2>#<synth-node[loading]: post_tonal_overtone.core/sin2 9762>
**** "adding" waveforms requires scaling
  #+BEGIN_SRC clojure :session getting-started
(defsynth sin-square [freq 440] 
  (out 0 (* 0.5
            (+ (square (* 0.5 freq))
               (sin-osc freq))))
  (out 1 (* 0.5
            (+ (square (* 0.5 freq))
               (sin-osc freq)))))

(sin-square)
  #+END_SRC

  #+RESULTS:
  : #<synth: sin-square>#<synth-node[loading]: post_tonal_overto485/sin-square 210>
