src/post_tonal_overtone/org_files/html-versions/personalized-overtone-wiki-in-one-file.html
<li><a id="orgheadline41"></a>ugens as control signals<br  /><div class="outline-text-6" id="text-3-1-1-2-2">
<p>
Here is an adjustable width pulse wave shifting the frequency of the
main oscillator
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">spooky-house</span> [freq 440 width 0.2
                       attack 0.3 sustain 4
                       release 0.3 vol 0.4]
  (* (env-gen (lin attack sustain release) 1 1 0 1 <span style="color: #BFEBBF;">FREE</span>)
     (sin-osc (+ freq (* 20 (lf-pulse:kr 0.5 0 width))))
     vol))

(spooky-house)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(spooky-house <span style="color: #BFEBBF;">:width</span> 0.1)
</pre>
</div>
</div></li>

<li><a id="orgheadline45"></a>wavetable synthesis<br  /><ol class="org-ol"><li><a id="orgheadline42"></a>No examples of this<br  /><div class="outline-text-7" id="text-3-1-1-2-3-1">
<p>
"In wavetable synthesis, a single period waveform is stored in a
buffer and used as a lookup table for the osc osciallator."
</p>

<p>
Great, thanks.
</p>
</div></li>
<li><a id="orgheadline44"></a>experiments<br  /><ol class="org-ol"><li><a id="orgheadline43"></a>my lf-noise<br  /><div class="outline-text-8" id="text-3-1-1-2-3-2-1">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">my-dynamic</span> [freq 440 width 0.2
                       attack 0.3 sustain 4
                       release 0.3 vol 0.4]
  (* (env-gen (lin attack sustain release) 1 1 0 1 <span style="color: #BFEBBF;">FREE</span>)
     (sin-osc (+ freq (* 20 (lf-noise1:kr 100))))
     vol))

(my-dynamic)
</pre>
</div>

<p>
Note, approximately 14 second long, as suggested by the integers used
as arguments for the env-gen
</p>
<div class="org-src-container">

<pre class="src src-clojure">(my-dynamic <span style="color: #BFEBBF;">:attack</span> 2 <span style="color: #BFEBBF;">:sustain</span> 10 <span style="color: #BFEBBF;">:release</span> 4)
</pre>
</div>
</div></li></ol></li></ol></li></ol></li></ol>
</div>

<div id="outline-container-orgheadline52" class="outline-4">
<h4 id="orgheadline52"><span class="section-number-4">3.1.2</span> filtering</h4>
<div class="outline-text-4" id="text-3-1-2">
</div><ol class="org-ol"><li><a id="orgheadline50"></a>linear filters<br  /><div class="outline-text-5" id="text-3-1-2-1">
<p>
Overtone comes with a number of standard linear filters: lpf, hpf, and
bpf are low-pass, high-pass and band-pass filters respectively.
</p>
</div>
<ol class="org-ol"><li><a id="orgheadline48"></a>use mouse-x interactively<br  /><div class="outline-text-6" id="text-3-1-2-1-1">
<div class="org-src-container">

<pre class="src src-clojure">(demo 10 (lpf (saw 100) (mouse-x 40 5000 <span style="color: #BFEBBF;">EXP</span>)))
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">low-pass; move the mouse left and right to change the threshold frequency</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(demo 10 (hpf (saw 100) (mouse-x 40 5000 <span style="color: #BFEBBF;">EXP</span>)))
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">high-pass; move the mouse left and right to change the threshold frequency</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(demo 30 
      (bpf (saw 100)
           (mouse-x 40 5000 <span style="color: #BFEBBF;">EXP</span>)
           (mouse-y 0.01 1 <span style="color: #BFEBBF;">LIN</span>)))
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">band-pass; move mouse left/right to change threshold frequency; up/down to change bandwidth (top is narrowest)</span>
</pre>
</div>
</div></li>
<li><a id="orgheadline49"></a>(demo 30 (bpf (pink-noise) (mouse-x 40 5000 EXP) (mouse-y 0.01 1 LIN)))<br  /><div class="outline-text-6" id="text-3-1-2-1-2">
<div class="org-src-container">

<pre class="src src-clojure">(demo 30 (bpf (pink-noise) (mouse-x 40 5000 <span style="color: #BFEBBF;">EXP</span>) (mouse-y 0.01 1 <span style="color: #BFEBBF;">LIN</span>)))
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">band-pass; move mouse left/right to change threshold frequency; up/down to change bandwidth (top is narrowest)</span>
</pre>
</div>

<p>
poses the question, what are the standard x-left x-right and y-top
y-bottom values which these functions are mapping?
</p>
</div></li></ol></li>
<li><a id="orgheadline51"></a>non-linear filters<br  /><div class="outline-text-5" id="text-3-1-2-2">
<p>
You can do Karplus-Strong string synthesis with the pluck filter.
Karplus-Strong works by taking a signal, filtering it and feeding it
back into itself after a delay, so that the output eventually becomes
periodic.
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">here we generate a pulse of white noise, and pass it through a pluck filter</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">with a delay based on the given frequency</span>
(<span style="color: #F0DFAF; font-weight: bold;">let</span> [freq (rand-nth '(440 550 660 770 880 990 1100 1210 1320))]
   (demo (pluck (* (white-noise) (env-gen (perc 0.001 2) <span style="color: #BFEBBF;">:action</span> <span style="color: #BFEBBF;">FREE</span>)) 1 3 (/ 1 freq))))
</pre>
</div>
</div></li></ol>
</div>
<div id="outline-container-orgheadline60" class="outline-4">
<h4 id="orgheadline60"><span class="section-number-4">3.1.3</span> multi-channel, stereo, panning</h4>
<div class="outline-text-4" id="text-3-1-3">
</div><ol class="org-ol"><li><a id="orgheadline56"></a>mono defsynth<br  /><ol class="org-ol"><li><a id="orgheadline53"></a>left = 0<br  /><div class="outline-text-6" id="text-3-1-3-1-1">
<div class="org-src-container">

<pre class="src src-clojure">(demo (out 0 (sin-osc)))
</pre>
</div>
</div></li>
<li><a id="orgheadline54"></a>right = 1<br  /><div class="outline-text-6" id="text-3-1-3-1-2">
<div class="org-src-container">

<pre class="src src-clojure">(demo (out 1 (sin-osc)))
</pre>
</div>
</div></li>
<li><a id="orgheadline55"></a>sin0 and sin1<br  /><div class="outline-text-6" id="text-3-1-3-1-3">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defsynth</span> <span style="color: #93E0E3;">sin0</span> [freq 660]
  (out 0 (sin-osc freq)))

(sin0)
</pre>
</div>


<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defsynth</span> <span style="color: #93E0E3;">sin1</span> [freq 660]
  (out 1 (sin-osc freq)))

(demo (sin1))
</pre>
</div>
</div></li></ol></li>

<li><a id="orgheadline57"></a>stereo defsynth&#x2013;takes 'two &amp; body' parameters<br  /><div class="outline-text-5" id="text-3-1-3-2">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defsynth</span> <span style="color: #93E0E3;">sin2</span> [freq1 440 freq2 441]
  (out 0 (sin-osc freq1))
  (out 1 (sin-osc freq2)))

(demo (sin2))
</pre>
</div>
</div></li>
<li><a id="orgheadline58"></a>"adding" waveforms requires scaling<br  /><div class="outline-text-5" id="text-3-1-3-3">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defsynth</span> <span style="color: #93E0E3;">sin-square</span> [freq 440] 
  (out 0 (* 0.5
            (+ (square (* 0.5 freq))
               (sin-osc freq))))
  (out 1 (* 0.5
            (+ (square (* 0.5 freq))
               (sin-osc freq)))))

(sin-square)
</pre>
</div>
</div></li>
