docs/orzo/multi-part-overtone-tutorial/personalized-overtone-wiki-in-one-file.org
**** MULTICHANNEL EXPANSION--passing collections 

  Passing a collection to a ugen where a single argument is expected.
  The following returns a "seq of two osciallators." It's as if the single
  channel of input has been "automatically expanded" to process multiple channels.
  #+BEGIN_SRC clojure :session getting-started
(demo (sin-osc [440 443]))
  #+END_SRC


  #+RESULTS:
  : #<synth-node[loading]: post_tonal_ov485/audition-synth 9763>

  Passing this seq to another ugen, it will also be expanded (in this case
  #+BEGIN_SRC clojure :session getting-started
(demo 10 (lpf (saw:ar [440 443]) (mouse-x 100 5000 LIN)))
  #+END_SRC

  #+RESULTS:
  : #<synth-node[loading]: post_tonal_ov485/audition-synth 9764>

  Now, compare with the above synth; the output is same, but there's
  less repeated code.


  #+BEGIN_SRC clojure :session getting-started

(defsynth sin-square2 [freq 440] 
  (out 0 (* [0.5 0.5] (+ (square (* 0.5 freq))
                         (sin-osc freq)))))
;; can't demo a defsynth?
(demo (sin-square2))
  #+END_SRC

  #+RESULTS:
  : #<synth: sin-square2>#<synth-node[loading]: post_tonal_ov485/audition-synth 9766>

  Now, the two waveforms are distribued across the channels (um, are
  they? In what sense?) 
  #+BEGIN_SRC clojure :session getting-started
(defsynth sin-square3 [freq 440] 
  (out 0 (* 0.5
            [(square (* 0.5 freq))
             (sin-osc freq)])))

(sin-square3)
  #+END_SRC

  #+RESULTS:
  : #<synth: sin-square3>#<synth-node[loading]: post_tonal_overt485/sin-square3 9767>
** instruments and io
*** buffers and audio files
**** playing samples and songs
***** playing samples from local files

   #+BEGIN_SRC clojure :session getting-started
(def CERN-noise (sample "/Applications/SuperCollider/SuperCollider.app/Contents/Resources/sounds/CERN-noisepad8.aiff"))

(CERN-noise)
   #+END_SRC

   #+RESULTS:
   : #'post_tonal_overtone.core/CERN-noise#<synth-node[loading]: overtone.sc.sample/mono-player 32>
***** playing arbitrary files as a playlist
   #+BEGIN_SRC clojure :session getting-started
(def spirit (sample (str "/Users/a/Music/audio/" "Spiritualized/" "06 Spiritualized - Step Into The Breeze.aiff")))
   #+END_SRC

   #+RESULTS:
   : #'post_tonal_overtone.core/spirit

   #+BEGIN_SRC clojure :session getting-started
(spirit)
   #+END_SRC
***** building files for song-player
