docs/orzo/multi-part-overtone-tutorial/personalized-overtone-wiki-in-one-file.org
****** does not play mp3s

    template for string concatentation
    #+BEGIN_SRC clojure :session getting-started
(str "/Users/a/Music/audio/" "QC listening list/pre-1600/")
    #+END_SRC


    #+TITLE pre1600-list
    #+BEGIN_SRC clojure :session getting-started
(def pre1600-list '("008_Barbara_Strozzi_L'Eraclito.mp3"                 
"008_Belle_Doette.mp3"                               
"008_Bernard_de_Ventadorn_Quan_veh_la_lauzeta_mover.mp3"
"008_Byrd_John_Come_Kiss_me_Now.mp3"
"008_Byrd_Mass_for_4_voices_Agnus_Dei.mp3"           
"008_Byrd_Mass_for_4_voices_Credo.mp3"               
"008_Byrd_Mass_for_4_voices_Kyrie.mp3"               
"008_Ciconia_O_Padua_sidus_preclarum.mp3"            
"008_Dufay_Ave_regina_caelorum.mp3"                  
"008_Frescobaldi_Capriccio_sopra_ut_re_me_fa_sol_la.mp3"
"008_Gabrieli_Canzon_in_echo_duodecimi_toni.mp3"
"008_Giaches_de_Wert_Giunto_alla_Tomba.mp3"          
"008_Hildegard_von_Bingen_O_virga_ac_diadema.mp3"    
"008_Hodie_Christus_natus_est.mp3"                   
"008_Josquin_Inviolata_integra_et_casta_est_Maria.mp"
"008_Josquin_Milles_Regretz.mp3"                     
"008_Josquin_Missa_Pange_lingua_Agnus_Dei.mp3"       
"008_Josquin_Missa_Pange_lingua_Kyrie.mp3"           
"008_Josquin_sexti_toni_1.mp3"                       
"008_Josquin_sexti_toni_5.mp3"                       
"008_Landini_Ochi_dolente_mie.mp3"                   
"008_Machaut_De_Fortune.mp3"                         
"008_Pange_lingua.mp3"                               
"008_Perotin_Viderunt_omnes.mp3"                     
"008_Purcell_Dido_and_Aeneas_Act_III_1_Scene_1_1.mp3"
"008_Purcell_Dido_and_Aeneas_Act_III_2_Scene_1_2.mp3"
"008_Purcell_Dido_and_Aeneas_Act_III_3_Scene_2_1.mp3"
"008_Purcell_Dido_and_Aeneas_Act_III_4_Scene_2_2.mp3"
"008_Purcell_Dido_and_Aeneas_Act_III_5_Scene_2_3.mp3"))
    #+END_SRC

    #+RESULTS:
    : #'post_tonal_overtone.core/pre1600-list

    #+BEGIN_SRC clojure :session getting-started
(rand-nth pre1600-list)
    #+END_SRC

    #+RESULTS:
    : 008_Landini_Ochi_dolente_mie.mp3

    #+BEGIN_SRC clojure :session getting-started
(str "/Users/a/Music/audio/" "QC listening list/pre-1600/" (rand-nth pre1600-list))
    #+END_SRC

    #+RESULTS:
    : /Users/a/Music/audio/QC listening list/pre-1600/008_Josquin_sexti_toni_1.mp3

    #+BEGIN_SRC clojure :session getting-started
(def play-1600s-tune (sample (str "/Users/a/Music/audio/" "QC listening list/pre-1600/" (rand-nth pre1600-list))))
    #+END_SRC

    #+BEGIN_SRC clojure :session getting-started
(def play-1600s-tune (sample "/Users/a/Music/audio/QC listening list/pre-1600/008_Pange_Lingua.wav"))
    #+END_SRC

    #+BEGIN_SRC clojure :session getting-started
(play-1600s-tune)
    #+END_SRC

    #+RESULTS:
    : #<synth-node[loading]: overtone.sc.saddd/stereo-player 645>
****** spiritualized aiff--working example
  #+BEGIN_SRC clojure
(def spirit-list '("06 Spiritualized - Step Into The Breeze.aiff"
"07 Spiritualized - Symphony Space.aiff"
"08 Spiritualized - Take Your Time.aiff"
"09 Spiritualized - Shine A Light.aiff"
"10 Spiritualized - Angel Sigh.aiff"
"11 Spiritualized - Sway.aiff"
"12 Spiritualized - 200 Bars.aiff"))
  #+END_SRC

  #+RESULTS:
  : #'user/spirit-list

   #+BEGIN_SRC clojure :session getting-started
;; requires spirit-list to be defined as above
(def spirit (sample (str "/Users/a/Music/audio/" "Spiritualized/" (rand-nth spirit-list))))
(spirit)
   #+END_SRC

   #+RESULTS:
   : #'user/spirit#<synth-node[loading]: overtone.sc.saddd/stereo-player 36>
****** template

  #+BEGIN_SRC clojure :session getting-started
(let [spirit-song (rand-nth spirit-list)
      audio-dir "/Users/a/Music/audio/"
      subdir-folder "Spiritualized/"]
  (str audio-dir subdir-folder spirit-song))
  #+END_SRC

  #+BEGIN_SRC clojure :session getting-started
(let [spirit-song (rand-nth spirit-list)
            audio-dir "/Users/a/Music/audio/"
            subdir-folder "/"]
        (str audio-dir subdir-folder spirit-song))
  #+END_SRC
****** various directories

  /Users/a/Music/audio/

  Mouse\ On\ Mars\ -\ Autoditacker\ \(FLAC\)/

  01\ -\ Mouse\ On\ Mars\ -\ Sui\ Shop.flac

  Kin

  /Users/a/Music/audio/

  King\ Sunny\ Ade\ Best\ of\ Island\ Years/



  01\ -\ 01Ja\ Fummi.flac

  /Users/a/Music/audio/

  Miles\ Davis/

  01\ Miles\ Davis\ -\ Compulsion.flac


  /Users/a/Music/audio/

  Mouse\ On\ Mars\ -\ Autoditacker\ \(FLAC\)/

  01\ -\ Mouse\ On\ Mars\ -\ Sui\ Shop.flac


  /Users/a/Music/audio/

  Mouse\ On\ Mars\ -\ Parastrophics\ \(2012\)\ \[FLAC\]\ politux/

  01\ The\ Beach\ Stop.flac
****** conversions folder
  #+BEGIN_SRC clojure :session getting-started
(def conv-dir (clojure.java.io/file "/Users/a/Music/conversions"))
  #+END_SRC

  #+RESULTS:
  : #'user/conv-dir

  #+BEGIN_SRC clojure :session getting-started
(def conv-files (file-seq conv-dir))
  #+END_SRC

  #+RESULTS:
  : #'user/conv-files

  #+BEGIN_SRC clojure :session getting-started
conv-files
  #+END_SRC

  #+RESULTS:
  : '(#<File /Users/a/Music/conversions> #<File /Users/a/Music/conversions/.DS_Store> #<File /Users/a/Music/conversions/008_Barbara_Strozzi_L"Eraclito.mp3> #<File /Users/a/Music/conversions/008_Barbara_Strozzi_L"Eraclito.mp3.wav>)

  "/Users/a/Music/conversions/008_Barbara_Strozzi_L'Eraclito.mp3.wav"
**** random samples from my machine
  #+BEGIN_SRC clojure :session getting-started
(def sampled-sounds (sample
                     (str "/Applications/SuperCollider/SuperCollider.app/Contents/Resources/sounds/"
                          (rand-nth '("strings-and-clicks.wav" "CERN-noisepad8.aiff" "amp-mono.wav" "susp-mono.wav")))))
(sampled-sounds)
  #+END_SRC

  #+RESULTS:
  : #'post_tonal_overtone.core/sampled-sounds#<synth-node[loading]: overtone.sc.sample/mono-player 340>
