src/post_tonal_overtone/org_files/html-versions/personalized-overtone-wiki-in-one-file.html
<li><a id="orgheadline70"></a>building files for song-player<br  /><ol class="org-ol"><li><a id="orgheadline65"></a>does not play mp3s<br  /><div class="outline-text-7" id="text-3-2-2-1-3-1">
<p>
template for string concatentation
</p>
<div class="org-src-container">

<pre class="src src-clojure">(str <span style="color: #CC9393;">"/Users/a/Music/audio/"</span> <span style="color: #CC9393;">"QC listening list/pre-1600/"</span>)
</pre>
</div>


<p>
#+TITLE pre1600-list
</p>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">pre1600-list</span> '(<span style="color: #CC9393;">"008_Barbara_Strozzi_L'Eraclito.mp3"</span>                 
<span style="color: #CC9393;">"008_Belle_Doette.mp3"</span>                               
<span style="color: #CC9393;">"008_Bernard_de_Ventadorn_Quan_veh_la_lauzeta_mover.mp3"</span>
<span style="color: #CC9393;">"008_Byrd_John_Come_Kiss_me_Now.mp3"</span>
<span style="color: #CC9393;">"008_Byrd_Mass_for_4_voices_Agnus_Dei.mp3"</span>           
<span style="color: #CC9393;">"008_Byrd_Mass_for_4_voices_Credo.mp3"</span>               
<span style="color: #CC9393;">"008_Byrd_Mass_for_4_voices_Kyrie.mp3"</span>               
<span style="color: #CC9393;">"008_Ciconia_O_Padua_sidus_preclarum.mp3"</span>            
<span style="color: #CC9393;">"008_Dufay_Ave_regina_caelorum.mp3"</span>                  
<span style="color: #CC9393;">"008_Frescobaldi_Capriccio_sopra_ut_re_me_fa_sol_la.mp3"</span>
<span style="color: #CC9393;">"008_Gabrieli_Canzon_in_echo_duodecimi_toni.mp3"</span>
<span style="color: #CC9393;">"008_Giaches_de_Wert_Giunto_alla_Tomba.mp3"</span>          
<span style="color: #CC9393;">"008_Hildegard_von_Bingen_O_virga_ac_diadema.mp3"</span>    
<span style="color: #CC9393;">"008_Hodie_Christus_natus_est.mp3"</span>                   
<span style="color: #CC9393;">"008_Josquin_Inviolata_integra_et_casta_est_Maria.mp"</span>
<span style="color: #CC9393;">"008_Josquin_Milles_Regretz.mp3"</span>                     
<span style="color: #CC9393;">"008_Josquin_Missa_Pange_lingua_Agnus_Dei.mp3"</span>       
<span style="color: #CC9393;">"008_Josquin_Missa_Pange_lingua_Kyrie.mp3"</span>           
<span style="color: #CC9393;">"008_Josquin_sexti_toni_1.mp3"</span>                       
<span style="color: #CC9393;">"008_Josquin_sexti_toni_5.mp3"</span>                       
<span style="color: #CC9393;">"008_Landini_Ochi_dolente_mie.mp3"</span>                   
<span style="color: #CC9393;">"008_Machaut_De_Fortune.mp3"</span>                         
<span style="color: #CC9393;">"008_Pange_lingua.mp3"</span>                               
<span style="color: #CC9393;">"008_Perotin_Viderunt_omnes.mp3"</span>                     
<span style="color: #CC9393;">"008_Purcell_Dido_and_Aeneas_Act_III_1_Scene_1_1.mp3"</span>
<span style="color: #CC9393;">"008_Purcell_Dido_and_Aeneas_Act_III_2_Scene_1_2.mp3"</span>
<span style="color: #CC9393;">"008_Purcell_Dido_and_Aeneas_Act_III_3_Scene_2_1.mp3"</span>
<span style="color: #CC9393;">"008_Purcell_Dido_and_Aeneas_Act_III_4_Scene_2_2.mp3"</span>
<span style="color: #CC9393;">"008_Purcell_Dido_and_Aeneas_Act_III_5_Scene_2_3.mp3"</span>))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(rand-nth pre1600-list)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(str <span style="color: #CC9393;">"/Users/a/Music/audio/"</span> <span style="color: #CC9393;">"QC listening list/pre-1600/"</span> (rand-nth pre1600-list))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">play-1600s-tune</span> (sample (str <span style="color: #CC9393;">"/Users/a/Music/audio/"</span> <span style="color: #CC9393;">"QC listening list/pre-1600/"</span> (rand-nth pre1600-list))))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">play-1600s-tune</span> (sample <span style="color: #CC9393;">"/Users/a/Music/audio/QC listening list/pre-1600/008_Pange_Lingua.wav"</span>))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(play-1600s-tune)
</pre>
</div>
</div></li>
<li><a id="orgheadline66"></a>spiritualized aiff&#x2013;working example<br  /><div class="outline-text-7" id="text-3-2-2-1-3-2">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">spirit-list</span> '(<span style="color: #CC9393;">"06 Spiritualized - Step Into The Breeze.aiff"</span>
<span style="color: #CC9393;">"07 Spiritualized - Symphony Space.aiff"</span>
<span style="color: #CC9393;">"08 Spiritualized - Take Your Time.aiff"</span>
<span style="color: #CC9393;">"09 Spiritualized - Shine A Light.aiff"</span>
<span style="color: #CC9393;">"10 Spiritualized - Angel Sigh.aiff"</span>
<span style="color: #CC9393;">"11 Spiritualized - Sway.aiff"</span>
<span style="color: #CC9393;">"12 Spiritualized - 200 Bars.aiff"</span>))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">requires spirit-list to be defined as above</span>
(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">spirit</span> (sample (str <span style="color: #CC9393;">"/Users/a/Music/audio/"</span> <span style="color: #CC9393;">"Spiritualized/"</span> (rand-nth spirit-list))))
(spirit)
</pre>
</div>
</div></li>
<li><a id="orgheadline67"></a>template<br  /><div class="outline-text-7" id="text-3-2-2-1-3-3">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">let</span> [spirit-song (rand-nth spirit-list)
      audio-dir <span style="color: #CC9393;">"/Users/a/Music/audio/"</span>
      subdir-folder <span style="color: #CC9393;">"Spiritualized/"</span>]
  (str audio-dir subdir-folder spirit-song))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">let</span> [spirit-song (rand-nth spirit-list)
            audio-dir <span style="color: #CC9393;">"/Users/a/Music/audio/"</span>
            subdir-folder <span style="color: #CC9393;">"/"</span>]
        (str audio-dir subdir-folder spirit-song))
</pre>
</div>
</div></li>
<li><a id="orgheadline68"></a>various directories<br  /><div class="outline-text-7" id="text-3-2-2-1-3-4">
<p>
<i>Users/a/Music/audio</i>
</p>

<p>
Mouse\ On\ Mars\ -\ Autoditacker\ \(FLAC\)/
</p>

<p>
01\ -\ Mouse\ On\ Mars\ -\ Sui\ Shop.flac
</p>

<p>
Kin
</p>

<p>
<i>Users/a/Music/audio</i>
</p>

<p>
King\ Sunny\ Ade\ Best\ of\ Island\ Years/
</p>



<p>
01\ -\ 01Ja\ Fummi.flac
</p>

<p>
<i>Users/a/Music/audio</i>
</p>

<p>
Miles\ Davis/
</p>

<p>
01\ Miles\ Davis\ -\ Compulsion.flac
</p>


<p>
<i>Users/a/Music/audio</i>
</p>

<p>
Mouse\ On\ Mars\ -\ Autoditacker\ \(FLAC\)/
</p>

<p>
01\ -\ Mouse\ On\ Mars\ -\ Sui\ Shop.flac
</p>


<p>
<i>Users/a/Music/audio</i>
</p>

<p>
Mouse\ On\ Mars\ -\ Parastrophics\ \(2012\)\ \[FLAC\]\ politux/
</p>

<p>
01\ The\ Beach\ Stop.flac
</p>
</div></li>
<li><a id="orgheadline69"></a>conversions folder<br  /><div class="outline-text-7" id="text-3-2-2-1-3-5">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">conv-dir</span> (<span style="color: #7CB8BB;">clojure.java.io</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>file <span style="color: #CC9393;">"/Users/a/Music/conversions"</span>))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">conv-files</span> (file-seq conv-dir))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">conv-files
</pre>
</div>

<p>
"/Users/a/Music/conversions/008<sub>Barbara</sub><sub>Strozzi</sub><sub>L</sub>'Eraclito.mp3.wav"
</p>
</div></li></ol></li></ol></li>
<li><a id="orgheadline72"></a>random samples from my machine<br  /><div class="outline-text-5" id="text-3-2-2-2">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">sampled-sounds</span> (sample
                     (str <span style="color: #CC9393;">"/Applications/SuperCollider/SuperCollider.app/Contents/Resources/sounds/"</span>
                          (rand-nth '(<span style="color: #CC9393;">"strings-and-clicks.wav"</span> <span style="color: #CC9393;">"CERN-noisepad8.aiff"</span> <span style="color: #CC9393;">"amp-mono.wav"</span> <span style="color: #CC9393;">"susp-mono.wav"</span>)))))
(sampled-sounds)
</pre>
</div>
</div></li>
