docs/orzo/multi-part-overtone-tutorial/personalized-overtone-wiki-in-one-file.org
**** loading a sample into a buffer

  #+BEGIN_SRC clojure :session getting-started
(def buff-random (load-sample
                  (str "/Applications/SuperCollider/SuperCollider.app/Contents/Resources/sounds/"
                       (rand-nth '("strings-and-clicks.wav"
                                   "CERN-noisepad8.aiff"
                                   "amp-mono.wav"
                                   "susp-mono.wav")))))
  #+END_SRC

  #+RESULTS:
  : #'post_tonal_overtone.core/buff-random
**** scope not available?
  #+BEGIN_SRC clojure :session getting-started
(scope :buf buff-random)
  #+END_SRC

  #+RESULTS:
**** play a sample from a buffer

  #+BEGIN_SRC clojure :session getting-started
(def sample-buf (load-sample
(str "/Applications/SuperCollider/SuperCollider.app/Contents/Resources/sounds/" 
"strings-and-clicks.wav"
;;"amp-mono.wav"
)))
  #+END_SRC

  #+RESULTS:
  : #'post_tonal_overtone.core/sample-buf
**** play a sample with reverb
  #+BEGIN_SRC clojure :session getting-started
(defsynth reverb-on-left []
  (let [dry (play-buf 1 sample-buf)
    wet (free-verb dry 1)]
    (out 0 [wet dry])))

(reverb-on-left)
  #+END_SRC

  #+RESULTS:

  #+BEGIN_SRC clojure :session getting-started
(defsynth all-big-reverb []
  (let [dry (play-buf 1 sample-buf)
    wet (free-verb dry 1 :room 0.9 :damp 0.1)]
    (out 0 [wet wet])))

(big-reverb-on-left)
  #+END_SRC

  #+RESULTS:
  : #<synth: all-big-reverb>#<synth-node[loading]: post-tona915/big-reverb-on-left 354>
**** loading sample from freesound

  #+BEGIN_SRC clojure :session getting-started
(def snare (freesound 26903))
(snare)
  #+END_SRC

  #+RESULTS:
  : #'user/snare#<synth-node[loading]: overtoddd/stereo-partial-player 375>

  #+BEGIN_SRC clojure :session getting-started
(snare)
  #+END_SRC
  #+RESULTS:
  : #<synth-node[loading]: overtoddd/stereo-partial-player 377>
**** other freesound samples (percussion)
  |   406 | click      |   436 | ride           |   777 | kick         |   802 | close-hat    |
  |  2086 | kick2      |  8323 | powerwords     |  9088 | jetbike      | 13254 | cymbal       |
  | 16309 | open-snare | 16568 | two-cows       | 25649 | subby        | 26657 | open-hat     |
  | 26903 | snare      | 30628 | steam-whistles | 33637 | boom         | 44293 | sleigh-bells |
  | 48310 | clap       | 50623 | water-drops    | 80187 | witch-cackle | 80401 | explosion    |
  | 87731 | snap       |       |                |       |              |       |              |
  |       |            |       |                |       |              |       |              |
*** midi--should be replaced with updated Markdown text!
# Overtone 0.9.1

See [the end of the midi/keyboard example](https://github.com/overtone/overtone/blob/master/src/overtone/examples/midi/keyboard.clj#L49-L64).


# Overtone 0.7.1

## Using the event stream

Overtone 0.7.1 automatically detects all connected MIDI devices on
boot and registers the appropriate handlers for you. To see a list of
MIDI devices detected by Overtone, use:


#+BEGIN_SRC clojure :session getting-started
(midi-connected-devices)
#+END_SRC

#+RESULTS:

The MIDI device should be connected and powered on before starting
Overtone. When you bash the keys on the keyboard, Overtone receives
internal events in its event stream. To see them use:


#+BEGIN_SRC clojure :session getting-started
(event-debug-on)
#+END_SRC

#+RESULTS:
: true

To stop:

#+BEGIN_SRC clojure :session getting-started
(event-debug-off)
#+END_SRC

#+RESULTS:
: false

You should see that for each key press, there are two events. A
general midi control change event:


#+BEGIN_SRC clojure :session getting-started
[:midi :note-on]
#+END_SRC

and a device-specific event i.e.:

#+BEGIN_SRC clojure :session getting-started
[:midi-device Evolution Electronics Ltd. Keystation 61e Keystation 61e :note-on]
#+END_SRC

For simplicity use the general event type:

#+BEGIN_SRC clojure :session getting-started
(on-event [:midi :note-on]
          (fn [e]
            (let [note (:note e)
                  vel  (:velocity e)]
              (your-instr note vel)))
          ::keyboard-handler)
#+END_SRC

The last argument is a keyword which can be used to refer to this
handler, so you can later do:


#+BEGIN_SRC clojure :session getting-started
(remove-event-handler ::keyboard-handler)
#+END_SRC

## Simple Midi Keyboard Control

Use `midi-poly-player` for simple control of Overtone instruments.

Define an inst to play with the midi keyboard

#+BEGIN_SRC clojure :session getting-started
(definst steel-drum [note 60 amp 0.8]
  (let [freq (midicps note)]
    (* amp
       (env-gen (perc 0.01 0.2) 1 1 0 1 :action FREE)
       (+ (sin-osc (/ freq 2))
          (rlpf (saw freq) (* 1.1 freq) 0.4)))))
#+END_SRC

Define a player that connects midi input to that instrument.

#+BEGIN_SRC clojure :session getting-started
(def player (midi-poly-player steel-drum))
#+END_SRC

When you want to stop or change sounds, use `midi-player-stop`.

#+BEGIN_SRC clojure :session getting-started
(midi-player-stop)
#+END_SRC
*** recording
**** create a file

  #+BEGIN_SRC clojure :session getting-started
(recording-start "~/Desktop/foo.wav")
;; make some noise. i.e.
(demo (pan2 (sin-osc)))
  #+END_SRC

  #+RESULTS:
  : :recording-started#<synth-node[loading]: post-tonal-ov915/audition-synth 641>

  #+BEGIN_SRC clojure :session getting-started
;; stop recording
(recording-stop)
  #+END_SRC

  #+RESULTS:
  : /Users/a/Desktop/foo.wav
**** play back file
  #+BEGIN_SRC clojure :session getting-started
(def desktop-foo (sample "~/Desktop/foo.wav"))

(desktop-foo)
  #+END_SRC

  #+RESULTS:
  : #'post_tonal_overtone.core/desktop-foo#<synth-node[loading]: overtone.sc.saddd/stereo-player 642>
**** save audio from a buffer to disk
  #+BEGIN_SRC clojure :session getting-started
(buffer-save b "~/Desktop/bong.wav") 
  #+END_SRC
**** available audio formats for buffer-stream

  See documentation below
  -------------------------
  overtone.live/buffer-stream
  ([path & args])
    Returns a buffer-stream which is similar to a regular buffer but may
    be used with the disk-out ugen to stream to a specific file on disk.
    Use #'buffer-stream-close to close the stream to finish recording to
    disk.

    Options:

    :n-chans     - Number of channels for the buffer
                   Default 2
    :size        - Buffer size
                   Default 65536
    :header      - Header format: "aiff", "next", "wav", "ircam", "raw"
                   Default "wav"
    :samples     - Sample format: "int8", "int16", "int24", "int32",
                                  "float", "double", "mulaw", "alaw"
                   Default "int16"

    Example usage:
    (buffer-stream "~/Desktop/foo.wav" :n-chans 1 :header "aiff"
					 :samples "int32")
**** save as flac?

  (recording-start "path/to/audio.flac" :header "flac")
  ;make-noise
  (recording-stop)

  AND

  (recording-start "/path/to/audio.flac")
  ;make-noise
  (recording-stop)
** making 'music'
*** pitches and chords
