src/post_tonal_overtone/org_files/html-versions/personalized-overtone-wiki-in-one-file.html
<li><a id="orgheadline73"></a>loading a sample into a buffer<br  /><div class="outline-text-5" id="text-3-2-2-3">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">buff-random</span> (load-sample
                  (str <span style="color: #CC9393;">"/Applications/SuperCollider/SuperCollider.app/Contents/Resources/sounds/"</span>
                       (rand-nth '(<span style="color: #CC9393;">"strings-and-clicks.wav"</span>
                                   <span style="color: #CC9393;">"CERN-noisepad8.aiff"</span>
                                   <span style="color: #CC9393;">"amp-mono.wav"</span>
                                   <span style="color: #CC9393;">"susp-mono.wav"</span>)))))
</pre>
</div>
</div></li>
<li><a id="orgheadline74"></a>scope not available?<br  /><div class="outline-text-5" id="text-3-2-2-4">
<div class="org-src-container">

<pre class="src src-clojure">(scope <span style="color: #BFEBBF;">:buf</span> buff-random)
</pre>
</div>
</div></li>
<li><a id="orgheadline75"></a>play a sample from a buffer<br  /><div class="outline-text-5" id="text-3-2-2-5">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">sample-buf</span> (load-sample
(str <span style="color: #CC9393;">"/Applications/SuperCollider/SuperCollider.app/Contents/Resources/sounds/"</span> 
<span style="color: #CC9393;">"strings-and-clicks.wav"</span>
<span style="color: #5F7F5F;">;;</span><span style="color: #7F9F7F;">"amp-mono.wav"</span>
)))
</pre>
</div>
</div></li>
<li><a id="orgheadline76"></a>play a sample with reverb<br  /><div class="outline-text-5" id="text-3-2-2-6">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defsynth</span> <span style="color: #93E0E3;">reverb-on-left</span> []
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [dry (play-buf 1 sample-buf)
    wet (free-verb dry 1)]
    (out 0 [wet dry])))

(reverb-on-left)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defsynth</span> <span style="color: #93E0E3;">all-big-reverb</span> []
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [dry (play-buf 1 sample-buf)
    wet (free-verb dry 1 <span style="color: #BFEBBF;">:room</span> 0.9 <span style="color: #BFEBBF;">:damp</span> 0.1)]
    (out 0 [wet wet])))

(big-reverb-on-left)
</pre>
</div>
</div></li>
<li><a id="orgheadline77"></a>loading sample from freesound<br  /><div class="outline-text-5" id="text-3-2-2-7">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">snare</span> (freesound 26903))
(snare)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(snare)
</pre>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">406</td>
<td class="org-left">click</td>
<td class="org-right">436</td>
<td class="org-left">ride</td>
<td class="org-right">777</td>
<td class="org-left">kick</td>
<td class="org-right">802</td>
<td class="org-left">close-hat</td>
</tr>

<tr>
<td class="org-right">2086</td>
<td class="org-left">kick2</td>
<td class="org-right">8323</td>
<td class="org-left">powerwords</td>
<td class="org-right">9088</td>
<td class="org-left">jetbike</td>
<td class="org-right">13254</td>
<td class="org-left">cymbal</td>
</tr>

<tr>
<td class="org-right">16309</td>
<td class="org-left">open-snare</td>
<td class="org-right">16568</td>
<td class="org-left">two-cows</td>
<td class="org-right">25649</td>
<td class="org-left">subby</td>
<td class="org-right">26657</td>
<td class="org-left">open-hat</td>
</tr>

<tr>
<td class="org-right">26903</td>
<td class="org-left">snare</td>
<td class="org-right">30628</td>
<td class="org-left">steam-whistles</td>
<td class="org-right">33637</td>
<td class="org-left">boom</td>
<td class="org-right">44293</td>
<td class="org-left">sleigh-bells</td>
</tr>

<tr>
<td class="org-right">48310</td>
<td class="org-left">clap</td>
<td class="org-right">50623</td>
<td class="org-left">water-drops</td>
<td class="org-right">80187</td>
<td class="org-left">witch-cackle</td>
<td class="org-right">80401</td>
<td class="org-left">explosion</td>
</tr>

<tr>
<td class="org-right">87731</td>
<td class="org-left">snap</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div></li></ol>
</div>
<div id="outline-container-orgheadline84" class="outline-4">
<h4 id="orgheadline84"><span class="section-number-4">3.2.3</span> recording</h4>
<div class="outline-text-4" id="text-3-2-3">
</div><ol class="org-ol"><li><a id="orgheadline79"></a>create a file<br  /><div class="outline-text-5" id="text-3-2-3-1">
<div class="org-src-container">

<pre class="src src-clojure">(recording-start <span style="color: #CC9393;">"~/Desktop/foo.wav"</span>)
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">make some noise. i.e.</span>
(demo (pan2 (sin-osc)))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">stop recording</span>
(recording-stop)
</pre>
</div>
</div></li>
<li><a id="orgheadline80"></a>play back file<br  /><div class="outline-text-5" id="text-3-2-3-2">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">desktop-foo</span> (sample <span style="color: #CC9393;">"~/Desktop/foo.wav"</span>))

(desktop-foo)
</pre>
</div>
</div></li>
<li><a id="orgheadline81"></a>save audio from a buffer to disk<br  /><div class="outline-text-5" id="text-3-2-3-3">
<div class="org-src-container">

<pre class="src src-clojure">(buffer-save b <span style="color: #CC9393;">"~/Desktop/bong.wav"</span>)
</pre>
</div>
</div></li>
<li><a id="orgheadline82"></a>available audio formats for buffer-stream<br  /><div class="outline-text-5" id="text-3-2-3-4">
<p>
See documentation below
</p>
<hr  />
<p>
overtone.live/buffer-stream
([path &amp; args])
  Returns a buffer-stream which is similar to a regular buffer but may
  be used with the disk-out ugen to stream to a specific file on disk.
  Use #'buffer-stream-close to close the stream to finish recording to
  disk.
</p>

<p>
Options:
</p>

<p>
:n-chans     - Number of channels for the buffer
               Default 2
:size        - Buffer size
               Default 65536
:header      - Header format: "aiff", "next", "wav", "ircam", "raw"
               Default "wav"
:samples     - Sample format: "int8", "int16", "int24", "int32",
                              "float", "double", "mulaw", "alaw"
               Default "int16"
</p>

<p>
Example usage:
(buffer-stream "~/Desktop/foo.wav" :n-chans 1 :header "aiff"
                                     :samples "int32")
</p>
</div></li>
<li><a id="orgheadline83"></a>save as flac?<br  /><div class="outline-text-5" id="text-3-2-3-5">
<p>
(recording-start "path/to/audio.flac" :header "flac")
;make-noise
(recording-stop)
</p>

<p>
AND
</p>

<p>
(recording-start "/path/to/audio.flac")
;make-noise
(recording-stop)
</p>
</div></li></ol>
</div>
</div>
