docs/orzo/multi-part-overtone-tutorial/personalized-overtone-wiki-in-one-file.org
**** playing chords and scale

 Much of this can be seen in 
 [the code]
 (https://github.com/overtone/overtone/blob/master/src/overtone/examples/getting_started/video.clj)
 that corresponds with the 
 [Overtone Live Coding video overview](http://vimeo.com/22798433).



***** ;; We use a saw-wave that we defined in the oscillators tutorial
  #+BEGIN_SRC clojure
;; We use a saw-wave that we defined in the oscillators tutorial
(definst saw-wave [freq 440 attack 0.01 sustain 0.4 release 0.1 vol 0.4] 
  (* (env-gen (env-lin attack sustain release) 1 1 0 1 FREE)
     (saw freq)
     vol))
  #+END_SRC

  #+RESULTS:
  : #<instrument: saw-wave>

***** ;; We can play notes using frequency in Hz
  #+BEGIN_SRC clojure

;; We can play notes using frequency in Hz
(saw-wave 440)
(saw-wave 523.25)
(saw-wave 261.62) ; This is C4
  #+END_SRC

  #+RESULTS:
  : #<synth-node[loading]: post_tonal_overtone485/saw-wave 227>#<synth-node[loading]: post_tonal_overtone485/saw-wave 228>#<synth-node[loading]: post_tonal_overtone485/saw-wave 229>

***** ;; We can also play notes using MIDI note values
  #+BEGIN_SRC clojure
;; We can also play notes using MIDI note values
(saw-wave (midi->hz 69))
(saw-wave (midi->hz 72))
(saw-wave (midi->hz 60)) ; This is C4
  #+END_SRC

  #+RESULTS:
  : #<synth-node[loading]: post_tonal_overtone485/saw-wave 230>#<synth-node[loading]: post_tonal_overtone485/saw-wave 231>#<synth-node[loading]: post_tonal_overtone485/saw-wave 232>

***** ;; We can play notes using standard music notes as well
  #+BEGIN_SRC clojure
;; We can play notes using standard music notes as well
(saw-wave (midi->hz (note :A4)))
(saw-wave (midi->hz (note :C5)))
(saw-wave (midi->hz (note :C4))) ; This is C4! Surprised?
  #+END_SRC

  #+RESULTS:
  : #<synth-node[loading]: post_tonal_overtone485/saw-wave 233>#<synth-node[loading]: post_tonal_overtone485/saw-wave 234>#<synth-node[loading]: post_tonal_overtone485/saw-wave 235>

***** ;; Define a function for convenience
  #+BEGIN_SRC clojure
;; Define a function for convenience
(defn note->hz [music-note]
	(midi->hz (note music-note)))
  #+END_SRC

  #+RESULTS:
  : #'post_tonal_overtone.core/note->hz

  #+BEGIN_SRC clojure
; Slightly less to type	
(saw-wave (note->hz :C5))
  #+END_SRC

  #+RESULTS:
  : #<synth-node[loading]: post_tonal_overtone485/saw-wave 236>

***** ;; Let's make it even easier
  #+BEGIN_SRC clojure
;; Let's make it even easier
(defn saw2 [music-note]
	(saw-wave (midi->hz (note music-note))))
	  #+END_SRC

  #+RESULTS:
  : #'post_tonal_overtone.core/saw2


  #+BEGIN_SRC clojure
;; Great!
(saw2 :A4)
(saw2 :C5)
(saw2 :C4)


  #+END_SRC

  #+RESULTS:
  : #<synth-node[loading]: post_tonal_overtone485/saw-wave 237>#<synth-node[loading]: post_tonal_overtone485/saw-wave 238>#<synth-node[loading]: post_tonal_overtone485/saw-wave 239>

***** ;; Let's play some chords

  #+BEGIN_SRC clojure

;; this is one possible implementation of play-chord
(defn play-chord [a-chord]
  (doseq [note a-chord] (saw2 note)))

;; We can play many types of chords.
;; For the complete list, visit 
;; https://github.com/overtone/overtone/blob/master/src/overtone/music/pitch.clj 
;; and search for "def CHORD"
(play-chord (chord :C4 :major))

  #+END_SRC

  #+RESULTS:
  : #'post_tonal_overtone.core/play-chord"def CHORD"nil

**** note: these involve timings, thus really belong in metro
***** ;; We can play a chord progression on the synth using times:
  #+BEGIN_SRC clojure
;; We can play a chord progression on the synth
;; using times:
(defn chord-progression-time []
  (let [time (now)]
    (at time (play-piano-chord (chord :C4 :m7+9)))
    (at (+ 2000 time) (play-piano-chord (chord :G3 :m11)))
    (at (+ 3000 time) (play-piano-chord (chord :F3 :m7+9)))
    (at (+ 4300 time) (play-piano-chord (chord :F3 :maj11)))
    (at (+ 5000 time) (play-piano-chord (chord :G3 :7+5-9)))))

(chord-progression-time)

  #+END_SRC

  #+RESULTS:
  : #'post_tonal_overtone.core/chord-progression-timenil
***** ;; or beats:
  #+BEGIN_SRC clojure
;; or beats:
(defonce metro (metronome 120))
(metro)
(defn chord-progression-beat [m beat-num]
  (at (m (+ 0 beat-num)) (play-piano-chord (chord :C4 :major)))
  (at (m (+ 4 beat-num)) (play-piano-chord (chord :G3 :major)))
  (at (m (+ 8 beat-num)) (play-piano-chord (chord :A3 :minor)))
  (at (m (+ 14 beat-num)) (play-piano-chord (chord :F3 :major)))  
)

(chord-progression-beat metro (metro))
  #+END_SRC

  #+RESULTS:
  : nil27262#'post_tonal_overtone.core/chord-progression-beatnil

  #+BEGIN_SRC clojure
;; or beats:
(def my-metro (metronome 480))
(defn chord-progression-beat [m beat-num]
  (at (m (+ 0 beat-num)) (play-piano-chord (chord :C4 :major)))
  (at (m (+ 4 beat-num)) (play-piano-chord (chord :G3 :major)))
  (at (m (+ 8 beat-num)) (play-piano-chord (chord :A3 :minor)))
  (at (m (+ 14 beat-num)) (play-piano-chord (chord :F3 :major)))  
)

(chord-progression-beat my-metro (my-metro))
  #+END_SRC

  #+RESULTS:
  : #'post_tonal_overtone.core/my-metro#'post_tonal_overtone.core/chord-progression-beatnil

