src/post_tonal_overtone/org_files/html-versions/personalized-overtone-wiki-in-one-file.html
<div id="outline-container-orgheadline122" class="outline-3">
<h3 id="orgheadline122"><span class="section-number-3">3.3</span> making 'music'</h3>
<div class="outline-text-3" id="text-3-3">
</div><div id="outline-container-orgheadline99" class="outline-4">
<h4 id="orgheadline99"><span class="section-number-4">3.3.1</span> pitches and chords</h4>
<div class="outline-text-4" id="text-3-3-1">
</div><ol class="org-ol"><li><a id="orgheadline93"></a>playing chords and scale<br  /><div class="outline-text-5" id="text-3-3-1-1">
<p>
Much of this can be seen in 
[the code]
(<a href="https://github.com/overtone/overtone/blob/master/src/overtone/examples/getting_started/video.clj">https://github.com/overtone/overtone/blob/master/src/overtone/examples/getting_started/video.clj</a>)
that corresponds with the 
[Overtone Live Coding video overview](<a href="http://vimeo.com/22798433">http://vimeo.com/22798433</a>).
</p>
</div>



<ol class="org-ol"><li><a id="orgheadline86"></a>;; We use a saw-wave that we defined in the oscillators tutorial<br  /><div class="outline-text-6" id="text-3-3-1-1-1">
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">We use a saw-wave that we defined in the oscillators tutorial</span>
(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">saw-wave</span> [freq 440 attack 0.01 sustain 0.4 release 0.1 vol 0.4] 
  (* (env-gen (env-lin attack sustain release) 1 1 0 1 <span style="color: #BFEBBF;">FREE</span>)
     (saw freq)
     vol))
</pre>
</div>
</div></li>

<li><a id="orgheadline87"></a>;; We can play notes using frequency in Hz<br  /><div class="outline-text-6" id="text-3-3-1-1-2">
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">We can play notes using frequency in Hz</span>
(saw-wave 440)
(saw-wave 523.25)
(saw-wave 261.62) <span style="color: #7F9F7F;">; This is C4</span>
</pre>
</div>
</div></li>

<li><a id="orgheadline88"></a>;; We can also play notes using MIDI note values<br  /><div class="outline-text-6" id="text-3-3-1-1-3">
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">We can also play notes using MIDI note values</span>
(saw-wave (midi-&gt;hz 69))
(saw-wave (midi-&gt;hz 72))
(saw-wave (midi-&gt;hz 60)) <span style="color: #7F9F7F;">; This is C4</span>
</pre>
</div>
</div></li>

<li><a id="orgheadline89"></a>;; We can play notes using standard music notes as well<br  /><div class="outline-text-6" id="text-3-3-1-1-4">
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">We can play notes using standard music notes as well</span>
(saw-wave (midi-&gt;hz (note <span style="color: #BFEBBF;">:A4</span>)))
(saw-wave (midi-&gt;hz (note <span style="color: #BFEBBF;">:C5</span>)))
(saw-wave (midi-&gt;hz (note <span style="color: #BFEBBF;">:C4</span>))) <span style="color: #7F9F7F;">; This is C4! Surprised?</span>
</pre>
</div>
</div></li>

<li><a id="orgheadline90"></a>;; Define a function for convenience<br  /><div class="outline-text-6" id="text-3-3-1-1-5">
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Define a function for convenience</span>
(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">note-&gt;hz</span> [music-note]
        (midi-&gt;hz (note music-note)))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">Slightly less to type </span>
(saw-wave (note-&gt;hz <span style="color: #BFEBBF;">:C5</span>))
</pre>
</div>
</div></li>

<li><a id="orgheadline91"></a>;; Let's make it even easier<br  /><div class="outline-text-6" id="text-3-3-1-1-6">
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Let's make it even easier</span>
(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">saw2</span> [music-note]
        (saw-wave (midi-&gt;hz (note music-note))))
</pre>
</div>


<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Great!</span>
(saw2 <span style="color: #BFEBBF;">:A4</span>)
(saw2 <span style="color: #BFEBBF;">:C5</span>)
(saw2 <span style="color: #BFEBBF;">:C4</span>)
</pre>
</div>
</div></li>

<li><a id="orgheadline92"></a>;; Let's play some chords<br  /><div class="outline-text-6" id="text-3-3-1-1-7">
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">this is one possible implementation of play-chord</span>
(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">play-chord</span> [a-chord]
  (<span style="color: #F0DFAF; font-weight: bold;">doseq</span> [note a-chord] (saw2 note)))

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">We can play many types of chords.</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">For the complete list, visit </span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">https://github.com/overtone/overtone/blob/master/src/overtone/music/pitch.clj </span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">and search for "def CHORD"</span>
(play-chord (chord <span style="color: #BFEBBF;">:C4</span> <span style="color: #BFEBBF;">:major</span>))
</pre>
</div>
</div></li></ol></li>

<li><a id="orgheadline98"></a>note: these involve timings, thus really belong in metro<br  /><ol class="org-ol"><li><a id="orgheadline94"></a>;; We can play a chord progression on the synth using times:<br  /><div class="outline-text-6" id="text-3-3-1-2-1">
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">We can play a chord progression on the synth</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">using times:</span>
(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">chord-progression-time</span> []
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [time (now)]
    (at time (play-piano-chord (chord <span style="color: #BFEBBF;">:C4</span> <span style="color: #BFEBBF;">:m7+9</span>)))
    (at (+ 2000 time) (play-piano-chord (chord <span style="color: #BFEBBF;">:G3</span> <span style="color: #BFEBBF;">:m11</span>)))
    (at (+ 3000 time) (play-piano-chord (chord <span style="color: #BFEBBF;">:F3</span> <span style="color: #BFEBBF;">:m7+9</span>)))
    (at (+ 4300 time) (play-piano-chord (chord <span style="color: #BFEBBF;">:F3</span> <span style="color: #BFEBBF;">:maj11</span>)))
    (at (+ 5000 time) (play-piano-chord (chord <span style="color: #BFEBBF;">:G3</span> <span style="color: #BFEBBF;">:7+5-9</span>)))))

(chord-progression-time)
</pre>
</div>
</div></li>
<li><a id="orgheadline95"></a>;; or beats:<br  /><div class="outline-text-6" id="text-3-3-1-2-2">
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">or beats:</span>
(<span style="color: #F0DFAF; font-weight: bold;">defonce</span> <span style="color: #DFAF8F;">metro</span> (metronome 120))
(metro)
(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">chord-progression-beat</span> [m beat-num]
  (at (m (+ 0 beat-num)) (play-piano-chord (chord <span style="color: #BFEBBF;">:C4</span> <span style="color: #BFEBBF;">:major</span>)))
  (at (m (+ 4 beat-num)) (play-piano-chord (chord <span style="color: #BFEBBF;">:G3</span> <span style="color: #BFEBBF;">:major</span>)))
  (at (m (+ 8 beat-num)) (play-piano-chord (chord <span style="color: #BFEBBF;">:A3</span> <span style="color: #BFEBBF;">:minor</span>)))
  (at (m (+ 14 beat-num)) (play-piano-chord (chord <span style="color: #BFEBBF;">:F3</span> <span style="color: #BFEBBF;">:major</span>)))  
)

(chord-progression-beat metro (metro))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">or beats:</span>
(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">my-metro</span> (metronome 480))
(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">chord-progression-beat</span> [m beat-num]
  (at (m (+ 0 beat-num)) (play-piano-chord (chord <span style="color: #BFEBBF;">:C4</span> <span style="color: #BFEBBF;">:major</span>)))
  (at (m (+ 4 beat-num)) (play-piano-chord (chord <span style="color: #BFEBBF;">:G3</span> <span style="color: #BFEBBF;">:major</span>)))
  (at (m (+ 8 beat-num)) (play-piano-chord (chord <span style="color: #BFEBBF;">:A3</span> <span style="color: #BFEBBF;">:minor</span>)))
  (at (m (+ 14 beat-num)) (play-piano-chord (chord <span style="color: #BFEBBF;">:F3</span> <span style="color: #BFEBBF;">:major</span>)))  
)

(chord-progression-beat my-metro (my-metro))
</pre>
</div>
</div></li>
