docs/orzo/multi-part-overtone-tutorial/personalized-overtone-wiki-in-one-file.org
***** ;; We can use recursion to keep playing the chord progression--apply at
  #+BEGIN_SRC clojure
;; We can use recursion to keep playing the chord progression
(def my-slow-metro (metronome 40))
(defn chord-progression-beat [m beat-num]
  (at (m (+ 0 beat-num)) (play-piano-chord (chord :C4 :m7+9)))
  (at (m (+ 4 beat-num)) (play-piano-chord (chord :G3 :11)))
  (at (m (+ 8 beat-num)) (play-piano-chord (chord :A3 :m13)))
  (at (m (+ 12 beat-num)) (play-piano-chord (chord :F3 :7+5-9)))
  (apply-at (m (+ 16 beat-num)) chord-progression-beat m (+ 16 beat-num) [])
)
(chord-progression-beat my-slow-metro (my-slow-metro))
  #+END_SRC

  #+RESULTS:
  : #'post_tonal_overtone.core/my-slow-metro#'post_tonal_overtone.core/chord-progression-beat#<ScheduledJob id: 1, created-at: Wed 10:46:45s, initial-delay: 25482, desc: "Overtone delayed fn", scheduled? true>

***** recursion with random selections of chord type and roots
#+BEGIN_SRC clojure :session vle
(apply chord (list (rand-nth [:A4 :B4 :C4 :D4 :E4 :F4 :G4])
(rand-nth [:7sus2 :7-5 :m7-5 :7+5 :9 :7-9 :m7+5-9 :13 :m11+ :6*9])))
#+END_SRC

  #+BEGIN_SRC clojure
;; We can use recursion to keep playing the chord progression
(def my-slow-metro (metronome 60))
(defn random-chord-progression-beat [m beat-num]
  (at (m (+ 0 beat-num))
      (play-piano-chord (apply chord (list (rand-nth [:D3 :E3 :F3 :G3 :A4 :B4 :C4])
                                           (rand-nth [:7sus2 :7-5 :7+5 :9 :7-9 :13 :7-10 ])))))
  (at (m (+ 4 beat-num))
      (play-piano-chord (apply chord (list (rand-nth [:A4 :B4 :C4 :D4 :E4 :F4 :G4])
                                           (rand-nth [:m7-5 :m7+5 :m9 :m9+5 :m7-9 :m11 :m7+5-9 :m13 :m11+ :m6*9])))))
  (at (m (+ 8 beat-num))
      (play-piano-chord (apply chord (list (rand-nth [:A3 :B3 :C3 :D3 :E3 :F3 :G3])
                                           (rand-nth [:sus2 :6 :maj9 :maj11 :6*9 :+5])))))
  (at (m (+ 12 beat-num))
      (play-piano-chord (chord (rand-nth [:A3 :B3 :G3]) :7+5-9)))
  (apply-at (m (+ 16 beat-num)) random-chord-progression-beat m (+ 16 beat-num) [])
)
(random-chord-progression-beat my-slow-metro (my-slow-metro))
  #+END_SRC

  #+RESULTS:
  : #'post_tonal_overtone.core/my-slow-metro#'post_tonal_overtone.core/random-chord-progression-beat#<ScheduledJob id: 1, created-at: Wed 11:28:48s, initial-delay: 16982, desc: "Overtone delayed fn", scheduled? true>

#+BEGIN_SRC clojure
(stop)
#+END_SRC
*** scales and scale degrees
