src/post_tonal_overtone/org_files/html-versions/personalized-overtone-wiki-in-one-file.html

<li><a id="orgheadline96"></a>;; We can use recursion to keep playing the chord progression&#x2013;apply at<br  /><div class="outline-text-6" id="text-3-3-1-2-3">
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">We can use recursion to keep playing the chord progression</span>
(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">my-slow-metro</span> (metronome 40))
(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">chord-progression-beat</span> [m beat-num]
  (at (m (+ 0 beat-num)) (play-piano-chord (chord <span style="color: #BFEBBF;">:C4</span> <span style="color: #BFEBBF;">:m7+9</span>)))
  (at (m (+ 4 beat-num)) (play-piano-chord (chord <span style="color: #BFEBBF;">:G3</span> <span style="color: #BFEBBF;">:11</span>)))
  (at (m (+ 8 beat-num)) (play-piano-chord (chord <span style="color: #BFEBBF;">:A3</span> <span style="color: #BFEBBF;">:m13</span>)))
  (at (m (+ 12 beat-num)) (play-piano-chord (chord <span style="color: #BFEBBF;">:F3</span> <span style="color: #BFEBBF;">:7+5-9</span>)))
  (apply-at (m (+ 16 beat-num)) chord-progression-beat m (+ 16 beat-num) [])
)
(chord-progression-beat my-slow-metro (my-slow-metro))
</pre>
</div>
</div></li>

<li><a id="orgheadline97"></a>recursion with random selections of chord type and roots<br  /><div class="outline-text-6" id="text-3-3-1-2-4">
<div class="org-src-container">

<pre class="src src-clojure">(apply chord (list (rand-nth [<span style="color: #BFEBBF;">:A4</span> <span style="color: #BFEBBF;">:B4</span> <span style="color: #BFEBBF;">:C4</span> <span style="color: #BFEBBF;">:D4</span> <span style="color: #BFEBBF;">:E4</span> <span style="color: #BFEBBF;">:F4</span> <span style="color: #BFEBBF;">:G4</span>])
(rand-nth [<span style="color: #BFEBBF;">:7sus2</span> <span style="color: #BFEBBF;">:7-5</span> <span style="color: #BFEBBF;">:m7-5</span> <span style="color: #BFEBBF;">:7+5</span> <span style="color: #BFEBBF;">:9</span> <span style="color: #BFEBBF;">:7-9</span> <span style="color: #BFEBBF;">:m7+5-9</span> <span style="color: #BFEBBF;">:13</span> <span style="color: #BFEBBF;">:m11+</span> <span style="color: #BFEBBF;">:6*9</span>])))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">We can use recursion to keep playing the chord progression</span>
(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">my-slow-metro</span> (metronome 60))
(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">random-chord-progression-beat</span> [m beat-num]
  (at (m (+ 0 beat-num))
      (play-piano-chord (apply chord (list (rand-nth [<span style="color: #BFEBBF;">:D3</span> <span style="color: #BFEBBF;">:E3</span> <span style="color: #BFEBBF;">:F3</span> <span style="color: #BFEBBF;">:G3</span> <span style="color: #BFEBBF;">:A4</span> <span style="color: #BFEBBF;">:B4</span> <span style="color: #BFEBBF;">:C4</span>])
                                           (rand-nth [<span style="color: #BFEBBF;">:7sus2</span> <span style="color: #BFEBBF;">:7-5</span> <span style="color: #BFEBBF;">:7+5</span> <span style="color: #BFEBBF;">:9</span> <span style="color: #BFEBBF;">:7-9</span> <span style="color: #BFEBBF;">:13</span> <span style="color: #BFEBBF;">:7-10</span> ])))))
  (at (m (+ 4 beat-num))
      (play-piano-chord (apply chord (list (rand-nth [<span style="color: #BFEBBF;">:A4</span> <span style="color: #BFEBBF;">:B4</span> <span style="color: #BFEBBF;">:C4</span> <span style="color: #BFEBBF;">:D4</span> <span style="color: #BFEBBF;">:E4</span> <span style="color: #BFEBBF;">:F4</span> <span style="color: #BFEBBF;">:G4</span>])
                                           (rand-nth [<span style="color: #BFEBBF;">:m7-5</span> <span style="color: #BFEBBF;">:m7+5</span> <span style="color: #BFEBBF;">:m9</span> <span style="color: #BFEBBF;">:m9+5</span> <span style="color: #BFEBBF;">:m7-9</span> <span style="color: #BFEBBF;">:m11</span> <span style="color: #BFEBBF;">:m7+5-9</span> <span style="color: #BFEBBF;">:m13</span> <span style="color: #BFEBBF;">:m11+</span> <span style="color: #BFEBBF;">:m6*9</span>])))))
  (at (m (+ 8 beat-num))
      (play-piano-chord (apply chord (list (rand-nth [<span style="color: #BFEBBF;">:A3</span> <span style="color: #BFEBBF;">:B3</span> <span style="color: #BFEBBF;">:C3</span> <span style="color: #BFEBBF;">:D3</span> <span style="color: #BFEBBF;">:E3</span> <span style="color: #BFEBBF;">:F3</span> <span style="color: #BFEBBF;">:G3</span>])
                                           (rand-nth [<span style="color: #BFEBBF;">:sus2</span> <span style="color: #BFEBBF;">:6</span> <span style="color: #BFEBBF;">:maj9</span> <span style="color: #BFEBBF;">:maj11</span> <span style="color: #BFEBBF;">:6*9</span> <span style="color: #BFEBBF;">:+5</span>])))))
  (at (m (+ 12 beat-num))
      (play-piano-chord (chord (rand-nth [<span style="color: #BFEBBF;">:A3</span> <span style="color: #BFEBBF;">:B3</span> <span style="color: #BFEBBF;">:G3</span>]) <span style="color: #BFEBBF;">:7+5-9</span>)))
  (apply-at (m (+ 16 beat-num)) random-chord-progression-beat m (+ 16 beat-num) [])
)
(random-chord-progression-beat my-slow-metro (my-slow-metro))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(stop)
</pre>
</div>
</div></li></ol></li></ol>
</div>
