docs/orzo/multi-part-overtone-tutorial/personalized-overtone-wiki-in-one-file.org
**** notation issues
[Scales](https://en.wikipedia.org/wiki/Scale_%28music%29) can be
quickly generated using the `scale` function, which takes a root note
and the type of scale as arguments.


#+BEGIN_SRC clojure
(scale :C3 :major)
; => (48 50 52 53 55 57 59 60)
#+END_SRC

#+RESULTS:
| 48 | 50 | 52 | 53 | 55 | 57 | 59 | 60 |

The available scales are quite large, which includes the common
major/minor, modes (dorian, mixolydian, etc.), and more exotic scales.
You can see the full list by running the following command in your
REPL:


#+BEGIN_SRC clojure
;; uses println of course
(source SCALE)

#+END_SRC

or they are all produced here.
#+BEGIN_SRC clojure
(def SCALE
  (let [ionian-sequence     [2 2 1 2 2 2 1]
        hex-sequence        [2 2 1 2 2 3]
        pentatonic-sequence [3 2 2 3 2]
        rotate (fn [scale-sequence offset]
                 (take (count scale-sequence)
                       (drop offset (cycle scale-sequence))))]
    {:diatonic           ionian-sequence
     :ionian             (rotate ionian-sequence 0)
     :major              (rotate ionian-sequence 0)
     :dorian             (rotate ionian-sequence 1)
     :phrygian           (rotate ionian-sequence 2)
     :lydian             (rotate ionian-sequence 3)
     :mixolydian         (rotate ionian-sequence 4)
     :aeolian            (rotate ionian-sequence 5)
     :minor              (rotate ionian-sequence 5)
     :locrian            (rotate ionian-sequence 6)
     :hex-major6         (rotate hex-sequence 0)
     :hex-dorian         (rotate hex-sequence 1)
     :hex-phrygian       (rotate hex-sequence 2)
     :hex-major7         (rotate hex-sequence 3)
     :hex-sus            (rotate hex-sequence 4)
     :hex-aeolian        (rotate hex-sequence 5)
     :minor-pentatonic   (rotate pentatonic-sequence 0)
     :yu                 (rotate pentatonic-sequence 0)
     :major-pentatonic   (rotate pentatonic-sequence 1)
     :gong               (rotate pentatonic-sequence 1)
     :egyptian           (rotate pentatonic-sequence 2)
     :shang              (rotate pentatonic-sequence 2)
     :jiao               (rotate pentatonic-sequence 3)
     :pentatonic         (rotate pentatonic-sequence 4) ;; historical match
     :zhi                (rotate pentatonic-sequence 4)
     :ritusen            (rotate pentatonic-sequence 4)
     :whole-tone         [2 2 2 2 2 2]
     :whole              [2 2 2 2 2 2]
     :chromatic          [1 1 1 1 1 1 1 1 1 1 1 1]
     :harmonic-minor     [2 1 2 2 1 3 1]
     :melodic-minor-asc  [2 1 2 2 2 2 1]
     :hungarian-minor    [2 1 3 1 1 3 1]
     :octatonic          [2 1 2 1 2 1 2 1]
     :messiaen1          [2 2 2 2 2 2]
     :messiaen2          [1 2 1 2 1 2 1 2]
     :messiaen3          [2 1 1 2 1 1 2 1 1]
     :messiaen4          [1 1 3 1 1 1 3 1]
     :messiaen5          [1 4 1 1 4 1]
     :messiaen6          [2 2 1 1 2 2 1 1]
     :messiaen7          [1 1 1 2 1 1 1 1 2 1]
     :super-locrian      [1 2 1 2 2 2 2]
     :hirajoshi          [2 1 4 1 4]
     :kumoi              [2 1 4 2 3]
     :neapolitan-major   [1 2 2 2 2 2 1]
     :bartok             [2 2 1 2 1 2 2]
     :bhairav            [1 3 1 2 1 3 1]
     :locrian-major      [2 2 1 1 2 2 2]
     :ahirbhairav        [1 3 1 2 2 1 2]
     :enigmatic          [1 3 2 2 2 1 1]
     :neapolitan-minor   [1 2 2 2 1 3 1]
     :pelog              [1 2 4 1 4]
     :augmented2         [1 3 1 3 1 3]
     :scriabin           [1 3 3 2 3]
     :harmonic-major     [2 2 1 2 1 3 1]
     :melodic-minor-desc [2 1 2 2 1 2 2]
     :romanian-minor     [2 1 3 1 2 1 2]
     :hindu              [2 2 1 2 1 2 2]
     :iwato              [1 4 1 4 2]
     :melodic-minor      [2 1 2 2 2 2 1]
     :diminished2        [2 1 2 1 2 1 2 1]
     :marva              [1 3 2 1 2 2 1]
     :melodic-major      [2 2 1 2 1 2 2]
     :indian             [4 1 2 3 2]
     :spanish            [1 3 1 2 1 2 2]
     :prometheus         [2 2 2 5 1]
     :diminished         [1 2 1 2 1 2 1 2]
     :todi               [1 2 3 1 1 3 1]
     :leading-whole      [2 2 2 2 2 1 1]
     :augmented          [3 1 3 1 3 1]
     :purvi              [1 3 2 1 1 3 1]
     :chinese            [4 2 1 4 1]
     :lydian-minor       [2 2 2 1 1 2 2]}))
#+END_SRC



Overtone is also capable further abstraction of pitches through [scale
degrees](https://en.wikipedia.org/wiki/Degree_%28music%29), which is a
way of referring to pitches within a scale. Scale degrees are commonly
notated using roman numerals (I, IV, vii, etc.), so in Clojure scale
degrees are referenced with keywords as shown below:


#+BEGIN_SRC clojure
(def scale-degrees [:i :ii :iii :iv :v :vi :vii])
#+END_SRC

#+RESULTS:
: #'post_tonal_overtone.core/scale-degrees

Notice that each of the scale degrees is lowercase; Overtone does not
change the quality of the scale degree based on capitalization.
Capitalized degrees will throw an `IllegalArgumentException`.


You can resolve scale degrees into absolute pitches using
`degrees->pitches`:


#+BEGIN_SRC clojure
(degrees->pitches scale-degrees :dorian :E3)
; => (52 54 55 57 59 61 62)
#+END_SRC

#+RESULTS:
| 52 | 54 | 55 | 57 | 59 | 61 | 62 |

Scale degrees can be augmented by either `+` or `-` to denote the
octave above or below the root of the scale, and can be sharped or
flatted using `#` or `b`. For example in a major scale starting from
C3 (MIDI pitch number 48), the scale degree `:ib+` would be resolved
to a Cb4 (MIDI pitch number 59).


Another useful feature of scale degrees in Overtone is the `:_`
keyword, which you can use to denote rests. Below is an example that
uses both note ornament and the `:_` nil value:
