src/post_tonal_overtone/org_files/html-versions/personalized-overtone-wiki-in-one-file.html
<div id="outline-container-orgheadline103" class="outline-4">
<h4 id="orgheadline103"><span class="section-number-4">3.3.2</span> scales and scale degrees</h4>
<div class="outline-text-4" id="text-3-3-2">
</div><ol class="org-ol"><li><a id="orgheadline100"></a>notation issues<br  /><div class="outline-text-5" id="text-3-3-2-1">
<p>
[Scales](<a href="https://en.wikipedia.org/wiki/Scale_(music)">https://en.wikipedia.org/wiki/Scale_(music)</a>) can be
quickly generated using the `scale` function, which takes a root note
and the type of scale as arguments.
</p>


<div class="org-src-container">

<pre class="src src-clojure">(scale <span style="color: #BFEBBF;">:C3</span> <span style="color: #BFEBBF;">:major</span>)
<span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">=&gt; (48 50 52 53 55 57 59 60)</span>
</pre>
</div>

<p>
The available scales are quite large, which includes the common
major/minor, modes (dorian, mixolydian, etc.), and more exotic scales.
You can see the full list by running the following command in your
REPL:
</p>


<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">uses println of course</span>
(source <span style="color: #BFEBBF;">SCALE</span>)
</pre>
</div>

<p>
or they are all produced here.
</p>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">SCALE</span>
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [ionian-sequence     [2 2 1 2 2 2 1]
        hex-sequence        [2 2 1 2 2 3]
        pentatonic-sequence [3 2 2 3 2]
        rotate (<span style="color: #F0DFAF; font-weight: bold;">fn</span> [scale-sequence offset]
                 (take (count scale-sequence)
                       (drop offset (cycle scale-sequence))))]
    {<span style="color: #BFEBBF;">:diatonic</span>           ionian-sequence
     <span style="color: #BFEBBF;">:ionian</span>             (rotate ionian-sequence 0)
     <span style="color: #BFEBBF;">:major</span>              (rotate ionian-sequence 0)
     <span style="color: #BFEBBF;">:dorian</span>             (rotate ionian-sequence 1)
     <span style="color: #BFEBBF;">:phrygian</span>           (rotate ionian-sequence 2)
     <span style="color: #BFEBBF;">:lydian</span>             (rotate ionian-sequence 3)
     <span style="color: #BFEBBF;">:mixolydian</span>         (rotate ionian-sequence 4)
     <span style="color: #BFEBBF;">:aeolian</span>            (rotate ionian-sequence 5)
     <span style="color: #BFEBBF;">:minor</span>              (rotate ionian-sequence 5)
     <span style="color: #BFEBBF;">:locrian</span>            (rotate ionian-sequence 6)
     <span style="color: #BFEBBF;">:hex-major6</span>         (rotate hex-sequence 0)
     <span style="color: #BFEBBF;">:hex-dorian</span>         (rotate hex-sequence 1)
     <span style="color: #BFEBBF;">:hex-phrygian</span>       (rotate hex-sequence 2)
     <span style="color: #BFEBBF;">:hex-major7</span>         (rotate hex-sequence 3)
     <span style="color: #BFEBBF;">:hex-sus</span>            (rotate hex-sequence 4)
     <span style="color: #BFEBBF;">:hex-aeolian</span>        (rotate hex-sequence 5)
     <span style="color: #BFEBBF;">:minor-pentatonic</span>   (rotate pentatonic-sequence 0)
     <span style="color: #BFEBBF;">:yu</span>                 (rotate pentatonic-sequence 0)
     <span style="color: #BFEBBF;">:major-pentatonic</span>   (rotate pentatonic-sequence 1)
     <span style="color: #BFEBBF;">:gong</span>               (rotate pentatonic-sequence 1)
     <span style="color: #BFEBBF;">:egyptian</span>           (rotate pentatonic-sequence 2)
     <span style="color: #BFEBBF;">:shang</span>              (rotate pentatonic-sequence 2)
     <span style="color: #BFEBBF;">:jiao</span>               (rotate pentatonic-sequence 3)
     <span style="color: #BFEBBF;">:pentatonic</span>         (rotate pentatonic-sequence 4) <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">historical match</span>
     <span style="color: #BFEBBF;">:zhi</span>                (rotate pentatonic-sequence 4)
     <span style="color: #BFEBBF;">:ritusen</span>            (rotate pentatonic-sequence 4)
     <span style="color: #BFEBBF;">:whole-tone</span>         [2 2 2 2 2 2]
     <span style="color: #BFEBBF;">:whole</span>              [2 2 2 2 2 2]
     <span style="color: #BFEBBF;">:chromatic</span>          [1 1 1 1 1 1 1 1 1 1 1 1]
     <span style="color: #BFEBBF;">:harmonic-minor</span>     [2 1 2 2 1 3 1]
     <span style="color: #BFEBBF;">:melodic-minor-asc</span>  [2 1 2 2 2 2 1]
     <span style="color: #BFEBBF;">:hungarian-minor</span>    [2 1 3 1 1 3 1]
     <span style="color: #BFEBBF;">:octatonic</span>          [2 1 2 1 2 1 2 1]
     <span style="color: #BFEBBF;">:messiaen1</span>          [2 2 2 2 2 2]
     <span style="color: #BFEBBF;">:messiaen2</span>          [1 2 1 2 1 2 1 2]
     <span style="color: #BFEBBF;">:messiaen3</span>          [2 1 1 2 1 1 2 1 1]
     <span style="color: #BFEBBF;">:messiaen4</span>          [1 1 3 1 1 1 3 1]
     <span style="color: #BFEBBF;">:messiaen5</span>          [1 4 1 1 4 1]
     <span style="color: #BFEBBF;">:messiaen6</span>          [2 2 1 1 2 2 1 1]
     <span style="color: #BFEBBF;">:messiaen7</span>          [1 1 1 2 1 1 1 1 2 1]
     <span style="color: #BFEBBF;">:super-locrian</span>      [1 2 1 2 2 2 2]
     <span style="color: #BFEBBF;">:hirajoshi</span>          [2 1 4 1 4]
     <span style="color: #BFEBBF;">:kumoi</span>              [2 1 4 2 3]
     <span style="color: #BFEBBF;">:neapolitan-major</span>   [1 2 2 2 2 2 1]
     <span style="color: #BFEBBF;">:bartok</span>             [2 2 1 2 1 2 2]
     <span style="color: #BFEBBF;">:bhairav</span>            [1 3 1 2 1 3 1]
     <span style="color: #BFEBBF;">:locrian-major</span>      [2 2 1 1 2 2 2]
     <span style="color: #BFEBBF;">:ahirbhairav</span>        [1 3 1 2 2 1 2]
     <span style="color: #BFEBBF;">:enigmatic</span>          [1 3 2 2 2 1 1]
     <span style="color: #BFEBBF;">:neapolitan-minor</span>   [1 2 2 2 1 3 1]
     <span style="color: #BFEBBF;">:pelog</span>              [1 2 4 1 4]
     <span style="color: #BFEBBF;">:augmented2</span>         [1 3 1 3 1 3]
     <span style="color: #BFEBBF;">:scriabin</span>           [1 3 3 2 3]
     <span style="color: #BFEBBF;">:harmonic-major</span>     [2 2 1 2 1 3 1]
     <span style="color: #BFEBBF;">:melodic-minor-desc</span> [2 1 2 2 1 2 2]
     <span style="color: #BFEBBF;">:romanian-minor</span>     [2 1 3 1 2 1 2]
     <span style="color: #BFEBBF;">:hindu</span>              [2 2 1 2 1 2 2]
     <span style="color: #BFEBBF;">:iwato</span>              [1 4 1 4 2]
     <span style="color: #BFEBBF;">:melodic-minor</span>      [2 1 2 2 2 2 1]
     <span style="color: #BFEBBF;">:diminished2</span>        [2 1 2 1 2 1 2 1]
     <span style="color: #BFEBBF;">:marva</span>              [1 3 2 1 2 2 1]
     <span style="color: #BFEBBF;">:melodic-major</span>      [2 2 1 2 1 2 2]
     <span style="color: #BFEBBF;">:indian</span>             [4 1 2 3 2]
     <span style="color: #BFEBBF;">:spanish</span>            [1 3 1 2 1 2 2]
     <span style="color: #BFEBBF;">:prometheus</span>         [2 2 2 5 1]
     <span style="color: #BFEBBF;">:diminished</span>         [1 2 1 2 1 2 1 2]
     <span style="color: #BFEBBF;">:todi</span>               [1 2 3 1 1 3 1]
     <span style="color: #BFEBBF;">:leading-whole</span>      [2 2 2 2 2 1 1]
     <span style="color: #BFEBBF;">:augmented</span>          [3 1 3 1 3 1]
     <span style="color: #BFEBBF;">:purvi</span>              [1 3 2 1 1 3 1]
     <span style="color: #BFEBBF;">:chinese</span>            [4 2 1 4 1]
     <span style="color: #BFEBBF;">:lydian-minor</span>       [2 2 2 1 1 2 2]}))
</pre>
</div>



<p>
Overtone is also capable further abstraction of pitches through [scale
degrees](<a href="https://en.wikipedia.org/wiki/Degree_(music)">https://en.wikipedia.org/wiki/Degree_(music)</a>), which is a
way of referring to pitches within a scale. Scale degrees are commonly
notated using roman numerals (I, IV, vii, etc.), so in Clojure scale
degrees are referenced with keywords as shown below:
</p>


<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">scale-degrees</span> [<span style="color: #BFEBBF;">:i</span> <span style="color: #BFEBBF;">:ii</span> <span style="color: #BFEBBF;">:iii</span> <span style="color: #BFEBBF;">:iv</span> <span style="color: #BFEBBF;">:v</span> <span style="color: #BFEBBF;">:vi</span> <span style="color: #BFEBBF;">:vii</span>])
</pre>
</div>

<p>
Notice that each of the scale degrees is lowercase; Overtone does not
change the quality of the scale degree based on capitalization.
Capitalized degrees will throw an `IllegalArgumentException`.
</p>


<p>
You can resolve scale degrees into absolute pitches using
`degrees-&gt;pitches`:
</p>


<div class="org-src-container">

<pre class="src src-clojure">(degrees-&gt;pitches scale-degrees <span style="color: #BFEBBF;">:dorian</span> <span style="color: #BFEBBF;">:E3</span>)
<span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">=&gt; (52 54 55 57 59 61 62)</span>
</pre>
</div>

<p>
Scale degrees can be augmented by either `+` or `-` to denote the
octave above or below the root of the scale, and can be sharped or
flatted using `#` or `b`. For example in a major scale starting from
C3 (MIDI pitch number 48), the scale degree `:ib+` would be resolved
to a Cb4 (MIDI pitch number 59).
</p>


<p>
Another useful feature of scale degrees in Overtone is the `:_`
keyword, which you can use to denote rests. Below is an example that
uses both note ornament and the `:_` nil value:
</p>
</div></li>
