docs/orzo/multi-part-overtone-tutorial/personalized-overtone-wiki-in-one-file.org
**** modification to player so that it plays!
#+BEGIN_SRC clojure
;; this is a peculiar way to notate a melody
(def scale-degrees [:vi :vii :i+ :_ :vii :_ :i+ :vii :vi :_ :vii :_])
#+END_SRC

#+RESULTS:
: #'post_tonal_overtone.core/scale-degrees

#+BEGIN_SRC clojure :session vle
(def pitches (degrees->pitches scale-degrees :dorian :C4))
#+END_SRC

#+RESULTS:
: #'post_tonal_overtone.core/pitches

#+BEGIN_SRC clojure :session vle
(defn play [time notes sep]
  (let [note (first notes)]
    (when note
      (at time (saw1 (midi->hz note))))
    (let [next-time (+ time sep)]
      (apply-at next-time play [next-time (rest notes) sep]))))
#+END_SRC

#+RESULTS:
: #'post_tonal_overtone.core/play

#+BEGIN_SRC clojure :session vle
(play (now) pitches 1200)
#+END_SRC

#+RESULTS:
: #<ScheduledJob id: 2974, created-at: Thu 12:42:09s, initial-delay: 1199, desc: "Overtone delayed fn", scheduled? true>

**** play an arpeggio with piano
#+BEGIN_SRC clojure :session vle
(defn play [time notes sep]
  (let [note (first notes)]
    (when note
      (at time (sampled-piano note)))
    (let [next-time (+ time sep)]
      (apply-at next-time play [next-time (rest notes) sep]))))

(play (now) [60 64 71] 200)
#+END_SRC

#+RESULTS:
: #'post_tonal_overtone.core/play#<ScheduledJob id: 3943, created-at: Thu 12:43:03s, initial-delay: 199, desc: "Overtone delayed fn", scheduled? true>


*** metronome and sequencing
**** md of wiki--kick drum intensive recursive player
Here's an example of how to set up a simple metronome sound, for
musical practice. Note that once you define a metronome
(one-twenty-bpm in the example below), it will start counting beats.


#+BEGIN_SRC clojure :session getting-started
; setup a sound for our metronome to use
(def kick (sample (freesound-path 2086)))

; setup a tempo for our metronome to use
(def one-twenty-bpm (metronome 120))

; this function will play our sound at whatever tempo we've set our metronome to 
(defn looper [nome sound]    
    (let [beat (nome)]
        (at (nome beat) (sound))
        (apply-by (nome (inc beat)) looper nome sound [])))

; turn on the metronome
(looper one-twenty-bpm kick)
(stop)

; to get a feel for how the metronome works, try defining one at the REPL
(def nome (metronome 200))
(nome)
; 8 
; why is this 8? shouldn't it be 1? let's try it again
(nome)
;140
; whoah, it's almost like it's ticking in the background. 
; it is, in fact, ticking in the background. a "beat" is just convenient way to represent a timestamp.
; leave your metronome defined at the REPL, and the beat number will steadily increase, even if you aren't
; using the object for anything.
#+END_SRC
#+END_SRC

**** get a sample of a kick drum 
  #+BEGIN_SRC clojure :session getting-started
(def kick (sample (freesound-path 2086)))
  #+END_SRC

  #+RESULTS:
  : #'post_tonal_overtone.core/kick
**** create a metronome (set to a given bpm)
  #+BEGIN_SRC clojure :session getting-started
(def march-tempo (metronome 120))
  #+END_SRC

  #+RESULTS:
  : #'post_tonal_overtone.core/march-tempo
**** create a function that will, for a given a metro, play a sound
***** looping template
  #+BEGIN_SRC clojure :session getting-started
(defn looper [nome sound]
  (let [beat (nome)]
    (at (nome beat) (sound))
    (apply-at (nome (inc beat)) looper nome sound [])))
  #+END_SRC

  #+RESULTS:
  : #'post_tonal_overtone.core/looper
***** note: uses "temporal recursion" pattern--via 'apply-at'

  #+BEGIN_SRC clojure :session getting-started
(defn foo
     [t val]
     (println val)
     (let [next-t (+ t 10000)]
       (apply-at next-t #'foo [next-t (inc val)])))
  #+END_SRC

  #+RESULTS:
  : #'post_tonal_overtone.core/foo

  #+BEGIN_SRC clojure :session getting-started
(foo (now) 0)
  #+END_SRC

  #+RESULTS:
  : #<ScheduledJob id: 5437, created-at: Thu 12:44:08s, initial-delay: 10000, desc: "Overtone delayed fn", scheduled? true>
***** call the looper to play kick drum
  #+BEGIN_SRC clojure :session getting-started
(looper march-tempo kick)
  #+END_SRC

  #+RESULTS:
  : #<ScheduledJob id: 8, created-at: Thu 11:06:41s, initial-delay: 741, desc: "Overtone delayed fn", scheduled? true>

  #+BEGIN_SRC clojure :session getting-started
(def some-nome (metronome 60))
  #+END_SRC

  #+RESULTS:
  : #'post_tonal_overtone.core/some-nome

  #+BEGIN_SRC clojure :session getting-started
(some-nome)
  #+END_SRC

  #+RESULTS:
  : 6
**** understanding 'at' and 'apply-at' source code
from ~overtone/sc/server.clj~ and ~overtone/music/time~, respectively
***** at
overtone.live/at
([time-ms & body])
Macro
  Schedule server communication - specify that communication messages
   execute on the server at a specific time in the future:

   ;; control synth foo to change :freq to 150
   ;; one second from now:
   (at (+ (now) 1000) (ctl foo :freq 150))

   Only affects code that communicates with the server using OSC
   messaging i.e. synth triggering and control. All code in the body of
   the at macro is executed immediately. Any OSC messages which are
   triggered as a result of executing the body are not immediately sent
   but are instead captured and then sent in a single OSC bundle with
   the specified timestamp once the body has completed. The server then
   stores these bundles and executes them at the specified time. This
   allows you to schedule the triggering and control of synths for
   specific times.

   The bundling is thread-local, so you don't have to worry about
   accidentally scheduling packets into a bundle started on another
   thread.

   Be careful not to confuse at with apply-at and apply-by which
   directly affect Clojure code.

   Warning, all liveness and 'node blocking when not ready' checks are
   disabled within the context of this macro. This means that it will
   fail silently if a server node you wish to control either has been
   since terminated or not had time to be initialised.
