src/post_tonal_overtone/org_files/html-versions/personalized-overtone-wiki-in-one-file.html
<li><a id="orgheadline101"></a>modification to player so that it plays!<br  /><div class="outline-text-5" id="text-3-3-2-2">
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">this is a peculiar way to notate a melody</span>
(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">scale-degrees</span> [<span style="color: #BFEBBF;">:vi</span> <span style="color: #BFEBBF;">:vii</span> <span style="color: #BFEBBF;">:i+</span> <span style="color: #BFEBBF;">:_</span> <span style="color: #BFEBBF;">:vii</span> <span style="color: #BFEBBF;">:_</span> <span style="color: #BFEBBF;">:i+</span> <span style="color: #BFEBBF;">:vii</span> <span style="color: #BFEBBF;">:vi</span> <span style="color: #BFEBBF;">:_</span> <span style="color: #BFEBBF;">:vii</span> <span style="color: #BFEBBF;">:_</span>])
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">pitches</span> (degrees-&gt;pitches scale-degrees <span style="color: #BFEBBF;">:dorian</span> <span style="color: #BFEBBF;">:C4</span>))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">play</span> [time notes sep]
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [note (first notes)]
    (<span style="color: #F0DFAF; font-weight: bold;">when</span> note
      (at time (saw1 (midi-&gt;hz note))))
    (<span style="color: #F0DFAF; font-weight: bold;">let</span> [next-time (+ time sep)]
      (apply-at next-time play [next-time (rest notes) sep]))))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(play (now) pitches 1200)
</pre>
</div>
</div></li>

<li><a id="orgheadline102"></a>play an arpeggio with piano<br  /><div class="outline-text-5" id="text-3-3-2-3">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">play</span> [time notes sep]
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [note (first notes)]
    (<span style="color: #F0DFAF; font-weight: bold;">when</span> note
      (at time (sampled-piano note)))
    (<span style="color: #F0DFAF; font-weight: bold;">let</span> [next-time (+ time sep)]
      (apply-at next-time play [next-time (rest notes) sep]))))

(play (now) [60 64 71] 200)
</pre>
</div>
</div></li></ol>
</div>


<div id="outline-container-orgheadline114" class="outline-4">
<h4 id="orgheadline114"><span class="section-number-4">3.3.3</span> metronome and sequencing</h4>
<div class="outline-text-4" id="text-3-3-3">
</div><ol class="org-ol"><li><a id="orgheadline104"></a>md of wiki&#x2013;kick drum intensive recursive player<br  /><div class="outline-text-5" id="text-3-3-3-1">
<p>
Here's an example of how to set up a simple metronome sound, for
musical practice. Note that once you define a metronome
(one-twenty-bpm in the example below), it will start counting beats.
</p>


<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">setup a sound for our metronome to use</span>
(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">kick</span> (sample (freesound-path 2086)))

<span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">setup a tempo for our metronome to use</span>
(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">one-twenty-bpm</span> (metronome 120))

<span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">this function will play our sound at whatever tempo we've set our metronome to </span>
(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">looper</span> [nome sound]    
    (<span style="color: #F0DFAF; font-weight: bold;">let</span> [beat (nome)]
        (at (nome beat) (sound))
        (apply-by (nome (inc beat)) looper nome sound [])))

<span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">turn on the metronome</span>
(looper one-twenty-bpm kick)
(stop)

<span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">to get a feel for how the metronome works, try defining one at the REPL</span>
(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">nome</span> (metronome 200))
(nome)
<span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">8 </span>
<span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">why is this 8? shouldn't it be 1? let's try it again</span>
(nome)
<span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">140</span>
<span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">whoah, it's almost like it's ticking in the background. </span>
<span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">it is, in fact, ticking in the background. a "beat" is just convenient way to represent a timestamp.</span>
<span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">leave your metronome defined at the REPL, and the beat number will steadily increase, even if you aren't</span>
<span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">using the object for anything.</span>
</pre>
</div>
<p>
#+END<sub>SRC</sub>
</p>
</div></li>

<li><a id="orgheadline105"></a>get a sample of a kick drum<br  /><div class="outline-text-5" id="text-3-3-3-2">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">kick</span> (sample (freesound-path 2086)))
</pre>
</div>
</div></li>
<li><a id="orgheadline106"></a>create a metronome (set to a given bpm)<br  /><div class="outline-text-5" id="text-3-3-3-3">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">march-tempo</span> (metronome 120))
</pre>
</div>
</div></li>
<li><a id="orgheadline110"></a>create a function that will, for a given a metro, play a sound<br  /><ol class="org-ol"><li><a id="orgheadline107"></a>looping template<br  /><div class="outline-text-6" id="text-3-3-3-4-1">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">looper</span> [nome sound]
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [beat (nome)]
    (at (nome beat) (sound))
    (apply-at (nome (inc beat)) looper nome sound [])))
</pre>
</div>
</div></li>
<li><a id="orgheadline108"></a>note: uses "temporal recursion" pattern&#x2013;via 'apply-at'<br  /><div class="outline-text-6" id="text-3-3-3-4-2">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">foo</span>
     [t val]
     (println val)
     (<span style="color: #F0DFAF; font-weight: bold;">let</span> [next-t (+ t 10000)]
       (apply-at next-t #'foo [next-t (inc val)])))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(foo (now) 0)
</pre>
</div>
</div></li>
<li><a id="orgheadline109"></a>call the looper to play kick drum<br  /><div class="outline-text-6" id="text-3-3-3-4-3">
<div class="org-src-container">

<pre class="src src-clojure">(looper march-tempo kick)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">some-nome</span> (metronome 60))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(some-nome)
</pre>
</div>
</div></li></ol></li>
<li><a id="orgheadline113"></a>understanding 'at' and 'apply-at' source code<br  /><div class="outline-text-5" id="text-3-3-3-5">
<p>
from <code>overtone/sc/server.clj</code> and <code>overtone/music/time</code>, respectively
</p>
</div>
<ol class="org-ol"><li><a id="orgheadline111"></a>at<br  /><div class="outline-text-6" id="text-3-3-3-5-1">
<p>
overtone.live/at
([time-ms &amp; body])
Macro
  Schedule server communication - specify that communication messages
   execute on the server at a specific time in the future:
</p>

<p>
;; control synth foo to change :freq to 150
;; one second from now:
(at (+ (now) 1000) (ctl foo :freq 150))
</p>

<p>
Only affects code that communicates with the server using OSC
messaging i.e. synth triggering and control. All code in the body of
the at macro is executed immediately. Any OSC messages which are
triggered as a result of executing the body are not immediately sent
but are instead captured and then sent in a single OSC bundle with
the specified timestamp once the body has completed. The server then
stores these bundles and executes them at the specified time. This
allows you to schedule the triggering and control of synths for
specific times.
</p>

<p>
The bundling is thread-local, so you don't have to worry about
accidentally scheduling packets into a bundle started on another
thread.
</p>

<p>
Be careful not to confuse at with apply-at and apply-by which
directly affect Clojure code.
</p>

<p>
Warning, all liveness and 'node blocking when not ready' checks are
disabled within the context of this macro. This means that it will
fail silently if a server node you wish to control either has been
since terminated or not had time to be initialised.
</p>
</div></li>
