docs/orzo/multi-part-overtone-tutorial/personalized-overtone-wiki-in-one-file.org
***** apply-at
overtone.live/apply-at
([ms-time f args* argseq])
  Scheduled function appliction. Works identically to apply, except
   that it takes an additional initial argument: ms-time. If ms-time is
   in the future, function application is delayed until that time, if
   ms-time is in the past function application is immediate.

   If you wish to apply slightly before specific time rather than
   exactly at it, see apply-by.

   Can be used to implement the 'temporal recursion' pattern. This is
   where a function has a call to apply-at at its tail:

   (defn foo
     [t val]
     (println val)
     (let [next-t (+ t 200)]
       (apply-at next-t #'foo [next-t (inc val)])))

   (foo (now) 0) ;=> 0, 1, 2, 3...

   The fn foo is written in a recursive style, yet the recursion is
   scheduled for application 200ms in the future. By passing a function
   using #'foo syntax instead of the symbole foo, when later called by
   the scheduler it will lookup based on the symbol rather than using
   the instance of the function defined earlier. This allows us to
   redefine foo whilst the temporal recursion is continuing to execute.

   To stop an executing temporal recursion pattern, either redefine the
   function to not call itself, or use (stop).
*** live coding
**** md--work through time as events-in-time
***** First define some instruments:

#+BEGIN_SRC clojure :session getting-started
(definst kick [freq 120 dur 0.3 width 0.5]
  (let [freq-env (* freq (env-gen (perc 0 (* 0.99 dur))))
        env (env-gen (perc 0.01 dur) 1 1 0 1 FREE)
        sqr (* (env-gen (perc 0 0.01)) (pulse (* 2 freq) width))
        src (sin-osc freq-env)
        drum (+ sqr (* env src))]
    (compander drum drum 0.2 1 0.1 0.01 0.01)))

;(kick)

(definst c-hat [amp 0.8 t 0.04]
  (let [env (env-gen (perc 0.001 t) 1 1 0 1 FREE)
        noise (white-noise)
        sqr (* (env-gen (perc 0.01 0.04)) (pulse 880 0.2))
        filt (bpf (+ sqr noise) 9000 0.5)]
    (* amp env filt)))

;(c-hat)
#+END_SRC

#+RESULTS:
: #<instrument: kick>#<instrument: c-hat>
***** define the proper "metro" "timing-object" for use by a player

#+BEGIN_SRC clojure :session vle
(def metro (metronome 60))
#+END_SRC

#+RESULTS:
: #'post_tonal_overtone.core/metro

***** define a player
Now that we have everything ready, we can define a function that will
recurse through time, each iteration triggering the next beat.  By
passing the function to itself using the ```#'player``` type notation
we are passing the var `player` rather than the current value of that
var.  In this way the new value will be looked up every iteration,
which allows us to continually redefine the function as it's playing.
Try commenting out the hi-hat line, or adjusting when it gets
triggered, and then re-evaluate the function while it is still
playing.


#+BEGIN_SRC clojure :session getting-started

(defn player [beat]
  (at (metro beat) (kick))
  (at (metro (+ 0.5 beat)) (c-hat))
  (apply-by (metro (inc beat)) #'player (inc beat) []))

(player (metro))
#+END_SRC

#+RESULTS:
: #'post_tonal_overtone.core/player#<ScheduledJob id: 25575, created-at: Thu 12:58:39s, initial-delay: 1412, desc: "Overtone delayed fn", scheduled? true>

Change the playback speed by sending a message to metro like this:

#+BEGIN_SRC clojure
(metro-bpm metro 120)
#+END_SRC

#+RESULTS:
| :bpm | 120 |

#+BEGIN_SRC clojure :session vle
(metro-bpm metro 40)
#+END_SRC

#+RESULTS:
| :bpm | 40 |

***** understanding how metronome objects represent the temporal aspect of a sound environment
Create a metronome with a specific BPM (beats per minute).

The ~(metronome <bpm>)~ returns a function that can be used to
synchronize multiple instruments to the same rhythm. The metronome
remembers the time at which it was started and then when called with
no arguments it will return the current beat count, (as in Pd/Max, a
"bang" except with a current value) (i.e. # of beats since the start)
If called with one argument, a beat number, then a metronome function
will return the absolute timestamp in milliseconds that that beat will
occur. This timestamp can be used to schedule events at a specific
beat.

#+BEGIN_SRC clojure
(def metro (metronome 60))
(-  (metro 10) (now))
#+END_SRC

#+RESULTS:
: #'post_tonal_overtone.core/metro9999.0

#+BEGIN_SRC clojure :session vle
(metro) ; => current beat number

#+END_SRC

#+RESULTS:
: 26

#+BEGIN_SRC clojure :session vle
(-  (metro 100) (now))
#+END_SRC

#+RESULTS:
: 61519.0

#+END_SRC
#+BEGIN_SRC clojure :session vle

#+END_SRC

#+RESULTS:
: -89703.0

*** swing
(The rhythm, not the Java GUI toolkit. Sheesh.)

Someone asked at the Clojure West Unjam whether it was possible to
have a swing beat instead of the relentless techno OONTZ OONTZ OONTZ.


Why yes, yes it is:

#+BEGIN_SRC clojure :session getting-started
(definst c-hat [amp 0.8 t 0.04]
  (let [env (env-gen (perc 0.001 t) 1 1 0 1 FREE)
        noise (white-noise)
        sqr (* (env-gen (perc 0.01 0.04)) (pulse 880 0.2))
        filt (bpf (+ sqr noise) 9000 0.5)]
    (* amp env filt)))

(definst o-hat [amp 0.8 t 0.5]
  (let [env (env-gen (perc 0.001 t) 1 1 0 1 FREE)
        noise (white-noise)
        sqr (* (env-gen (perc 0.01 0.04)) (pulse 880 0.2))
        filt (bpf (+ sqr noise) 9000 0.5)]
    (* amp env filt)))

(defn swinger [beat]
  (at (metro beat) (o-hat))
  (at (metro (inc beat)) (c-hat))
  (at (metro (+ 1.65 beat)) (c-hat))
  (apply-at (metro (+ 2 beat)) #'swinger (+ 2 beat) []))

; define a metronome at a given tempo, expressed in beats per minute.
(def metro (metronome 120))

(swinger (metro))
#+END_SRC

#+RESULTS:
: #<instrument: c-hat>#<instrument: o-hat>#'post_tonal_overtone.core/swinger#'post_tonal_overtone.core/metro#<ScheduledJob id: 29726, created-at: Thu 01:01:31s, initial-delay: 1495, desc: "Overtone delayed fn", scheduled? true>

* other misc
** loading
