src/post_tonal_overtone/org_files/html-versions/personalized-overtone-wiki-in-one-file.html
<li><a id="orgheadline112"></a>apply-at<br  /><div class="outline-text-6" id="text-3-3-3-5-2">
<p>
overtone.live/apply-at
([ms-time f args* argseq])
  Scheduled function appliction. Works identically to apply, except
   that it takes an additional initial argument: ms-time. If ms-time is
   in the future, function application is delayed until that time, if
   ms-time is in the past function application is immediate.
</p>

<p>
If you wish to apply slightly before specific time rather than
exactly at it, see apply-by.
</p>

<p>
Can be used to implement the 'temporal recursion' pattern. This is
where a function has a call to apply-at at its tail:
</p>

<p>
(defn foo
  [t val]
  (println val)
  (let [next-t (+ t 200)]
    (apply-at next-t #'foo [next-t (inc val)])))
</p>

<p>
(foo (now) 0) ;=&gt; 0, 1, 2, 3&#x2026;
</p>

<p>
The fn foo is written in a recursive style, yet the recursion is
scheduled for application 200ms in the future. By passing a function
using #'foo syntax instead of the symbole foo, when later called by
the scheduler it will lookup based on the symbol rather than using
the instance of the function defined earlier. This allows us to
redefine foo whilst the temporal recursion is continuing to execute.
</p>

<p>
To stop an executing temporal recursion pattern, either redefine the
function to not call itself, or use (stop).
</p>
</div></li></ol></li></ol>
</div>
<div id="outline-container-orgheadline120" class="outline-4">
<h4 id="orgheadline120"><span class="section-number-4">3.3.4</span> live coding</h4>
<div class="outline-text-4" id="text-3-3-4">
</div><ol class="org-ol"><li><a id="orgheadline119"></a>md&#x2013;work through time as events-in-time<br  /><ol class="org-ol"><li><a id="orgheadline115"></a>First define some instruments:<br  /><div class="outline-text-6" id="text-3-3-4-1-1">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">kick</span> [freq 120 dur 0.3 width 0.5]
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [freq-env (* freq (env-gen (perc 0 (* 0.99 dur))))
        env (env-gen (perc 0.01 dur) 1 1 0 1 <span style="color: #BFEBBF;">FREE</span>)
        sqr (* (env-gen (perc 0 0.01)) (pulse (* 2 freq) width))
        src (sin-osc freq-env)
        drum (+ sqr (* env src))]
    (compander drum drum 0.2 1 0.1 0.01 0.01)))

<span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">(kick)</span>

(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">c-hat</span> [amp 0.8 t 0.04]
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [env (env-gen (perc 0.001 t) 1 1 0 1 <span style="color: #BFEBBF;">FREE</span>)
        noise (white-noise)
        sqr (* (env-gen (perc 0.01 0.04)) (pulse 880 0.2))
        filt (bpf (+ sqr noise) 9000 0.5)]
    (* amp env filt)))

<span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">(c-hat)</span>
</pre>
</div>
</div></li>
<li><a id="orgheadline116"></a>define the proper "metro" "timing-object" for use by a player<br  /><div class="outline-text-6" id="text-3-3-4-1-2">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">metro</span> (metronome 60))
</pre>
</div>
</div></li>

<li><a id="orgheadline117"></a>define a player<br  /><div class="outline-text-6" id="text-3-3-4-1-3">
<p>
Now that we have everything ready, we can define a function that will
recurse through time, each iteration triggering the next beat.  By
passing the function to itself using the ```#'player``` type notation
we are passing the var `player` rather than the current value of that
var.  In this way the new value will be looked up every iteration,
which allows us to continually redefine the function as it's playing.
Try commenting out the hi-hat line, or adjusting when it gets
triggered, and then re-evaluate the function while it is still
playing.
</p>


<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">player</span> [beat]
  (at (metro beat) (kick))
  (at (metro (+ 0.5 beat)) (c-hat))
  (apply-by (metro (inc beat)) #'player (inc beat) []))

(player (metro))
</pre>
</div>

<p>
Change the playback speed by sending a message to metro like this:
</p>

<div class="org-src-container">

<pre class="src src-clojure">(metro-bpm metro 120)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(metro-bpm metro 40)
</pre>
</div>
</div></li>

<li><a id="orgheadline118"></a>understanding how metronome objects represent the temporal aspect of a sound environment<br  /><div class="outline-text-6" id="text-3-3-4-1-4">
<p>
Create a metronome with a specific BPM (beats per minute).
</p>

<p>
The <code>(metronome &lt;bpm&gt;)</code> returns a function that can be used to
synchronize multiple instruments to the same rhythm. The metronome
remembers the time at which it was started and then when called with
no arguments it will return the current beat count, (as in Pd/Max, a
"bang" except with a current value) (i.e. # of beats since the start)
If called with one argument, a beat number, then a metronome function
will return the absolute timestamp in milliseconds that that beat will
occur. This timestamp can be used to schedule events at a specific
beat.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">metro</span> (metronome 60))
(-  (metro 10) (now))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(metro) <span style="color: #7F9F7F;">; =&gt; current beat number</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(-  (metro 100) (now))
</pre>
</div>

<p>
#+END<sub>SRC</sub>
</p>
<div class="org-src-container">

<pre class="src src-clojure"></pre>
</div>
</div></li></ol></li></ol>
</div>

<div id="outline-container-orgheadline121" class="outline-4">
<h4 id="orgheadline121"><span class="section-number-4">3.3.5</span> swing</h4>
<div class="outline-text-4" id="text-3-3-5">
<p>
(The rhythm, not the Java GUI toolkit. Sheesh.)
</p>

<p>
Someone asked at the Clojure West Unjam whether it was possible to
have a swing beat instead of the relentless techno OONTZ OONTZ OONTZ.
</p>


<p>
Why yes, yes it is:
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">c-hat</span> [amp 0.8 t 0.04]
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [env (env-gen (perc 0.001 t) 1 1 0 1 <span style="color: #BFEBBF;">FREE</span>)
        noise (white-noise)
        sqr (* (env-gen (perc 0.01 0.04)) (pulse 880 0.2))
        filt (bpf (+ sqr noise) 9000 0.5)]
    (* amp env filt)))

(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">o-hat</span> [amp 0.8 t 0.5]
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [env (env-gen (perc 0.001 t) 1 1 0 1 <span style="color: #BFEBBF;">FREE</span>)
        noise (white-noise)
        sqr (* (env-gen (perc 0.01 0.04)) (pulse 880 0.2))
        filt (bpf (+ sqr noise) 9000 0.5)]
    (* amp env filt)))

(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">swinger</span> [beat]
  (at (metro beat) (o-hat))
  (at (metro (inc beat)) (c-hat))
  (at (metro (+ 1.65 beat)) (c-hat))
  (apply-at (metro (+ 2 beat)) #'swinger (+ 2 beat) []))

<span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">define a metronome at a given tempo, expressed in beats per minute.</span>
(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">metro</span> (metronome 120))

(swinger (metro))
</pre>
</div>
</div>
</div>
</div>
</div>
