docs/orzo/multi-part-overtone-tutorial/personalized-overtone-wiki-in-one-file.org
** chris ford--clojure cookbook example
 Use Overtone to bring the song to life.

 Before starting, add [overtone "0.8.1"] to your projects dependencies
 or start a REPL using lein-try: footnote 10 here


 $ lein try overtone

 To start, define the melody for an old childrens song:

 #+BEGIN_SRC clojure
(require '[overtone.live :as overtone])

(defn note [timing pitch] {:time timing :pitch pitch})

(def melody (let [pitches
                  [0 0 0 1 2 ; Row, row, row your boat,
                   2 1 2 3 4 ; Gently down the stream,
                   7 7 7 4 4 4 2 2 2 0 0 0 ; (take 4 (repeat "merrily"))
                   4 3 2 1 0] ; Life is but a dream!
                  durations
                  [1 1 2/3 1/3 1
                   2/3 1/3 2/3 1/3 2
                   1/3 1/3 1/3 1/3 1/3 1/3 1/3 1/3 1/3 1/3 1/3 1/3
                   2/3 1/3 2/3 1/3 2]
                  times (reductions + 0 durations)]
              (map note times pitches)))

melody
;; -> ({:time 0, :pitch 0} ; Row,
;; {:time 1, :pitch 0} ; row,
;; {:time 2, :pitch 0} ; row
;; {:time 8/3, :pitch 1} ; your
;; {:time 3N, :pitch 2} ; boat ;; ...)
 #+END_SRC

 Convert the piece into a specific key by transforming each notes
 pitch using a function that represents the key:


 #+BEGIN_SRC clojure
(defn where [k f notes]
  (map #(update-in % [k] f) notes))

(defn scale [intervals] (fn [degree] (apply + (take degree intervals))))

(def major (scale [2 2 1 2 2 2 1]))

(defn from [n] (partial + n))

(def A (from 69))

(->> melody (where :pitch (comp A major)))
;; -> ({:time 0, :pitch 69} ; Row, ;; {:time 1, :pitch 69} ; row, ;; ...)
 #+END_SRC

 Convert the piece into a specific tempo by transforming each notes
 time using a function that represents the tempo:


 #+BEGIN_SRC clojure
(defn bpm [beats] (fn [beat] (/ (* beat 60 1000) beats)))

(->> melody
     (where :time (comp (from (overtone/now)) (bpm 90))))
;; -> ({:time 1383316072169, :pitch 0} ;; {:time 4149948218507/3, :pitch 0} ;; ...)
 #+END_SRC

 Now, define an instrument and use it to play the melody. The
 following example synthesized instrument is a simple sine wave, whose
 amplitude and duration are controlled by an envelope:


 #+BEGIN_SRC clojure
(require '[overtone.live :refer [definst line sin-osc FREE midi->hz at]])

(definst beep [freq 440] (let [envelope (line 1 0 0.5 :action FREE)] (* envelope (sin-osc freq))))

(defn play [notes] (doseq [{ms :time midi :pitch} notes] (at ms (beep (midi->hz midi)))))

;; Make sure your speakers are on...
(->> melody (where :pitch (comp A major)) (where :time (comp (from (overtone/now)) (bpm 90))) play)
;; -> <music playing on your speakers>
 #+END_SRC

 If your nursery rhyme is a round, like Row, Row, Row Your Boat, you
 can use it to accompany itself:


 #+BEGIN_SRC clojure
(defn round [beats notes]
  (concat notes (->> notes (where :time (from beats)))))

(->> melody
     (round 4)
     (where :pitch (comp A major))
     (where :time (comp (from (overtone/now)) (bpm 90)))
     play)
 #+END_SRC
** interupt output
 #+BEGIN_SRC clojure :session getting-started
(stop)
 #+END_SRC

 #+RESULTS:
 : nil
  
