src/post_tonal_overtone/org_files/html-versions/personalized-overtone-wiki-in-one-file.html

<div id="outline-container-orgheadline132" class="outline-3">
<h3 id="orgheadline132"><span class="section-number-3">4.6</span> chris ford&#x2013;clojure cookbook example</h3>
<div class="outline-text-3" id="text-4-6">
<p>
Use Overtone to bring the song to life.
</p>

<p>
Before starting, add [overtone "0.8.1"] to your projects dependencies
or start a REPL using lein-try: footnote 10 here
</p>


<p>
$ lein try overtone
</p>

<p>
To start, define the melody for an old childrens song:
</p>

<div class="org-src-container">

<pre class="src src-clojure">(require '[<span style="color: #7CB8BB;">overtone.live</span> <span style="color: #BFEBBF;">:as</span> overtone])

(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">note</span> [timing pitch] {<span style="color: #BFEBBF;">:time</span> timing <span style="color: #BFEBBF;">:pitch</span> pitch})

(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">melody</span> (<span style="color: #F0DFAF; font-weight: bold;">let</span> [pitches
                  [0 0 0 1 2 <span style="color: #7F9F7F;">; Row, row, row your boat,</span>
                   2 1 2 3 4 <span style="color: #7F9F7F;">; Gently down the stream,</span>
                   7 7 7 4 4 4 2 2 2 0 0 0 <span style="color: #7F9F7F;">; (take 4 (repeat "merrily"))</span>
                   4 3 2 1 0] <span style="color: #7F9F7F;">; Life is but a dream!</span>
                  durations
                  [1 1 2/3 1/3 1
                   2/3 1/3 2/3 1/3 2
                   1/3 1/3 1/3 1/3 1/3 1/3 1/3 1/3 1/3 1/3 1/3 1/3
                   2/3 1/3 2/3 1/3 2]
                  times (reductions + 0 durations)]
              (map note times pitches)))

melody
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">-&gt; ({</span><span style="color: #BFEBBF;">:time</span><span style="color: #7F9F7F;"> 0, </span><span style="color: #BFEBBF;">:pitch</span><span style="color: #7F9F7F;"> 0} ; Row,</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">{</span><span style="color: #BFEBBF;">:time</span><span style="color: #7F9F7F;"> 1, </span><span style="color: #BFEBBF;">:pitch</span><span style="color: #7F9F7F;"> 0} ; row,</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">{</span><span style="color: #BFEBBF;">:time</span><span style="color: #7F9F7F;"> 2, </span><span style="color: #BFEBBF;">:pitch</span><span style="color: #7F9F7F;"> 0} ; row</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">{</span><span style="color: #BFEBBF;">:time</span><span style="color: #7F9F7F;"> 8/3, </span><span style="color: #BFEBBF;">:pitch</span><span style="color: #7F9F7F;"> 1} ; your</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">{</span><span style="color: #BFEBBF;">:time</span><span style="color: #7F9F7F;"> 3N, </span><span style="color: #BFEBBF;">:pitch</span><span style="color: #7F9F7F;"> 2} ; boat ;; ...)</span>
</pre>
</div>

<p>
Convert the piece into a specific key by transforming each notes
pitch using a function that represents the key:
</p>


<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">where</span> [k f notes]
  (map #(update-in <span style="color: #DFAF8F;">%</span> [k] f) notes))

(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">scale</span> [intervals] (<span style="color: #F0DFAF; font-weight: bold;">fn</span> [degree] (apply + (take degree intervals))))

(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">major</span> (scale [2 2 1 2 2 2 1]))

(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">from</span> [n] (partial + n))

(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">A</span> (from 69))

(<span style="color: #F0DFAF; font-weight: bold;">-&gt;&gt;</span> melody (where <span style="color: #BFEBBF;">:pitch</span> (comp <span style="color: #BFEBBF;">A</span> major)))
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">-&gt; ({</span><span style="color: #BFEBBF;">:time</span><span style="color: #7F9F7F;"> 0, </span><span style="color: #BFEBBF;">:pitch</span><span style="color: #7F9F7F;"> 69} ; Row, ;; {</span><span style="color: #BFEBBF;">:time</span><span style="color: #7F9F7F;"> 1, </span><span style="color: #BFEBBF;">:pitch</span><span style="color: #7F9F7F;"> 69} ; row, ;; ...)</span>
</pre>
</div>

<p>
Convert the piece into a specific tempo by transforming each notes
time using a function that represents the tempo:
</p>


<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">bpm</span> [beats] (<span style="color: #F0DFAF; font-weight: bold;">fn</span> [beat] (/ (* beat 60 1000) beats)))

(<span style="color: #F0DFAF; font-weight: bold;">-&gt;&gt;</span> melody
     (where <span style="color: #BFEBBF;">:time</span> (comp (from (<span style="color: #7CB8BB;">overtone</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>now)) (bpm 90))))
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">-&gt; ({</span><span style="color: #BFEBBF;">:time</span><span style="color: #7F9F7F;"> 1383316072169, </span><span style="color: #BFEBBF;">:pitch</span><span style="color: #7F9F7F;"> 0} ;; {</span><span style="color: #BFEBBF;">:time</span><span style="color: #7F9F7F;"> 4149948218507/3, </span><span style="color: #BFEBBF;">:pitch</span><span style="color: #7F9F7F;"> 0} ;; ...)</span>
</pre>
</div>

<p>
Now, define an instrument and use it to play the melody. The
following example synthesized instrument is a simple sine wave, whose
amplitude and duration are controlled by an envelope:
</p>


<div class="org-src-container">

<pre class="src src-clojure">(require '[<span style="color: #7CB8BB;">overtone.live</span> <span style="color: #BFEBBF;">:refer</span> [definst line sin-osc <span style="color: #BFEBBF;">FREE</span> midi-&gt;hz at]])

(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">beep</span> [freq 440] (<span style="color: #F0DFAF; font-weight: bold;">let</span> [envelope (line 1 0 0.5 <span style="color: #BFEBBF;">:action</span> <span style="color: #BFEBBF;">FREE</span>)] (* envelope (sin-osc freq))))

(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">play</span> [notes] (<span style="color: #F0DFAF; font-weight: bold;">doseq</span> [{ms <span style="color: #BFEBBF;">:time</span> midi <span style="color: #BFEBBF;">:pitch</span>} notes] (at ms (beep (midi-&gt;hz midi)))))

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Make sure your speakers are on...</span>
(<span style="color: #F0DFAF; font-weight: bold;">-&gt;&gt;</span> melody (where <span style="color: #BFEBBF;">:pitch</span> (comp <span style="color: #BFEBBF;">A</span> major)) (where <span style="color: #BFEBBF;">:time</span> (comp (from (<span style="color: #7CB8BB;">overtone</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>now)) (bpm 90))) play)
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">-&gt; &lt;music playing on your speakers&gt;</span>
</pre>
</div>

<p>
If your nursery rhyme is a round, like Row, Row, Row Your Boat, you
can use it to accompany itself:
</p>


<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">round</span> [beats notes]
  (concat notes (<span style="color: #F0DFAF; font-weight: bold;">-&gt;&gt;</span> notes (where <span style="color: #BFEBBF;">:time</span> (from beats)))))

(<span style="color: #F0DFAF; font-weight: bold;">-&gt;&gt;</span> melody
     (round 4)
     (where <span style="color: #BFEBBF;">:pitch</span> (comp <span style="color: #BFEBBF;">A</span> major))
     (where <span style="color: #BFEBBF;">:time</span> (comp (from (<span style="color: #7CB8BB;">overtone</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>now)) (bpm 90)))
     play)
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: b</p>
<p class="date">Created: 2016-12-02 Fri 16:35</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
